GopalSaraf/Practicals/PSDL/include/proc/pic18lf66k40.h
extern volatile CK4PPSbits_t CK4PPSbits __at(0xE16);
// bitfield macros
#define _CK4PPS_PIN_POSN                                    0x0
#define _CK4PPS_PIN_POSITION                                0x0
#define _CK4PPS_PIN_SIZE                                    0x3
#define _CK4PPS_PIN_LENGTH                                  0x3
#define _CK4PPS_PIN_MASK                                    0x7
#define _CK4PPS_PORT_POSN                                   0x3
#define _CK4PPS_PORT_POSITION                               0x3
#define _CK4PPS_PORT_SIZE                                   0x2
#define _CK4PPS_PORT_LENGTH                                 0x2
#define _CK4PPS_PORT_MASK                                   0x18
#define _CK4PPS_TX4PPS_POSN                                 0x0
#define _CK4PPS_TX4PPS_POSITION                             0x0
#define _CK4PPS_TX4PPS_SIZE                                 0x6
#define _CK4PPS_TX4PPS_LENGTH                               0x6
#define _CK4PPS_TX4PPS_MASK                                 0x3F
#define _CK4PPS_TX4PPS0_POSN                                0x0
#define _CK4PPS_TX4PPS0_POSITION                            0x0
#define _CK4PPS_TX4PPS0_SIZE                                0x1
#define _CK4PPS_TX4PPS0_LENGTH                              0x1
#define _CK4PPS_TX4PPS0_MASK                                0x1
#define _CK4PPS_TX4PPS1_POSN                                0x1
#define _CK4PPS_TX4PPS1_POSITION                            0x1
#define _CK4PPS_TX4PPS1_SIZE                                0x1
#define _CK4PPS_TX4PPS1_LENGTH                              0x1
#define _CK4PPS_TX4PPS1_MASK                                0x2
#define _CK4PPS_TX4PPS2_POSN                                0x2
#define _CK4PPS_TX4PPS2_POSITION                            0x2
#define _CK4PPS_TX4PPS2_SIZE                                0x1
#define _CK4PPS_TX4PPS2_LENGTH                              0x1
#define _CK4PPS_TX4PPS2_MASK                                0x4
#define _CK4PPS_TX4PPS3_POSN                                0x3
#define _CK4PPS_TX4PPS3_POSITION                            0x3
#define _CK4PPS_TX4PPS3_SIZE                                0x1
#define _CK4PPS_TX4PPS3_LENGTH                              0x1
#define _CK4PPS_TX4PPS3_MASK                                0x8
#define _CK4PPS_TX4PPS4_POSN                                0x4
#define _CK4PPS_TX4PPS4_POSITION                            0x4
#define _CK4PPS_TX4PPS4_SIZE                                0x1
#define _CK4PPS_TX4PPS4_LENGTH                              0x1
#define _CK4PPS_TX4PPS4_MASK                                0x10
// alias bitfield definitions
typedef union {
    struct {
        unsigned PIN                    :3;
        unsigned PORT                   :2;
    };
    struct {
        unsigned TX4PPS                 :6;
    };
    struct {
        unsigned TX4PPS0                :1;
        unsigned TX4PPS1                :1;
        unsigned TX4PPS2                :1;
        unsigned TX4PPS3                :1;
        unsigned TX4PPS4                :1;
    };
} TX4PPSbits_t;
extern volatile TX4PPSbits_t TX4PPSbits __at(0xE16);
// bitfield macros
#define _TX4PPS_PIN_POSN                                    0x0
#define _TX4PPS_PIN_POSITION                                0x0
#define _TX4PPS_PIN_SIZE                                    0x3
#define _TX4PPS_PIN_LENGTH                                  0x3
#define _TX4PPS_PIN_MASK                                    0x7
#define _TX4PPS_PORT_POSN                                   0x3
#define _TX4PPS_PORT_POSITION                               0x3
#define _TX4PPS_PORT_SIZE                                   0x2
#define _TX4PPS_PORT_LENGTH                                 0x2
#define _TX4PPS_PORT_MASK                                   0x18
#define _TX4PPS_TX4PPS_POSN                                 0x0
#define _TX4PPS_TX4PPS_POSITION                             0x0
#define _TX4PPS_TX4PPS_SIZE                                 0x6
#define _TX4PPS_TX4PPS_LENGTH                               0x6
#define _TX4PPS_TX4PPS_MASK                                 0x3F
#define _TX4PPS_TX4PPS0_POSN                                0x0
#define _TX4PPS_TX4PPS0_POSITION                            0x0
#define _TX4PPS_TX4PPS0_SIZE                                0x1
#define _TX4PPS_TX4PPS0_LENGTH                              0x1
#define _TX4PPS_TX4PPS0_MASK                                0x1
#define _TX4PPS_TX4PPS1_POSN                                0x1
#define _TX4PPS_TX4PPS1_POSITION                            0x1
#define _TX4PPS_TX4PPS1_SIZE                                0x1
#define _TX4PPS_TX4PPS1_LENGTH                              0x1
#define _TX4PPS_TX4PPS1_MASK                                0x2
#define _TX4PPS_TX4PPS2_POSN                                0x2
#define _TX4PPS_TX4PPS2_POSITION                            0x2
#define _TX4PPS_TX4PPS2_SIZE                                0x1
#define _TX4PPS_TX4PPS2_LENGTH                              0x1
#define _TX4PPS_TX4PPS2_MASK                                0x4
#define _TX4PPS_TX4PPS3_POSN                                0x3
#define _TX4PPS_TX4PPS3_POSITION                            0x3
#define _TX4PPS_TX4PPS3_SIZE                                0x1
#define _TX4PPS_TX4PPS3_LENGTH                              0x1
#define _TX4PPS_TX4PPS3_MASK                                0x8
#define _TX4PPS_TX4PPS4_POSN                                0x4
#define _TX4PPS_TX4PPS4_POSITION                            0x4
#define _TX4PPS_TX4PPS4_SIZE                                0x1
#define _TX4PPS_TX4PPS4_LENGTH                              0x1
#define _TX4PPS_TX4PPS4_MASK                                0x10

// Register: RX5PPS
#define RX5PPS RX5PPS
extern volatile unsigned char           RX5PPS              __at(0xE17);
#ifndef _LIB_BUILD
asm("RX5PPS equ 0E17h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PIN                    :3;
        unsigned PORT                   :3;
    };
    struct {
        unsigned RX5PPS                 :6;
    };
    struct {
        unsigned RX5PPS0                :1;
        unsigned RX5PPS1                :1;
        unsigned RX5PPS2                :1;
        unsigned RX5PPS3                :1;
        unsigned RX5PPS4                :1;
        unsigned RX5PPS5                :1;
    };
} RX5PPSbits_t;
extern volatile RX5PPSbits_t RX5PPSbits __at(0xE17);
// bitfield macros
#define _RX5PPS_PIN_POSN                                    0x0
#define _RX5PPS_PIN_POSITION                                0x0
#define _RX5PPS_PIN_SIZE                                    0x3
#define _RX5PPS_PIN_LENGTH                                  0x3
#define _RX5PPS_PIN_MASK                                    0x7
#define _RX5PPS_PORT_POSN                                   0x3
#define _RX5PPS_PORT_POSITION                               0x3
#define _RX5PPS_PORT_SIZE                                   0x3
#define _RX5PPS_PORT_LENGTH                                 0x3
#define _RX5PPS_PORT_MASK                                   0x38
#define _RX5PPS_RX5PPS_POSN                                 0x0
#define _RX5PPS_RX5PPS_POSITION                             0x0
#define _RX5PPS_RX5PPS_SIZE                                 0x6
#define _RX5PPS_RX5PPS_LENGTH                               0x6
#define _RX5PPS_RX5PPS_MASK                                 0x3F
#define _RX5PPS_RX5PPS0_POSN                                0x0
#define _RX5PPS_RX5PPS0_POSITION                            0x0
#define _RX5PPS_RX5PPS0_SIZE                                0x1
#define _RX5PPS_RX5PPS0_LENGTH                              0x1
#define _RX5PPS_RX5PPS0_MASK                                0x1
#define _RX5PPS_RX5PPS1_POSN                                0x1
#define _RX5PPS_RX5PPS1_POSITION                            0x1
#define _RX5PPS_RX5PPS1_SIZE                                0x1
#define _RX5PPS_RX5PPS1_LENGTH                              0x1
#define _RX5PPS_RX5PPS1_MASK                                0x2
#define _RX5PPS_RX5PPS2_POSN                                0x2
#define _RX5PPS_RX5PPS2_POSITION                            0x2
#define _RX5PPS_RX5PPS2_SIZE                                0x1
#define _RX5PPS_RX5PPS2_LENGTH                              0x1
#define _RX5PPS_RX5PPS2_MASK                                0x4
#define _RX5PPS_RX5PPS3_POSN                                0x3
#define _RX5PPS_RX5PPS3_POSITION                            0x3
#define _RX5PPS_RX5PPS3_SIZE                                0x1
#define _RX5PPS_RX5PPS3_LENGTH                              0x1
#define _RX5PPS_RX5PPS3_MASK                                0x8
#define _RX5PPS_RX5PPS4_POSN                                0x4
#define _RX5PPS_RX5PPS4_POSITION                            0x4
#define _RX5PPS_RX5PPS4_SIZE                                0x1
#define _RX5PPS_RX5PPS4_LENGTH                              0x1
#define _RX5PPS_RX5PPS4_MASK                                0x10
#define _RX5PPS_RX5PPS5_POSN                                0x5
#define _RX5PPS_RX5PPS5_POSITION                            0x5
#define _RX5PPS_RX5PPS5_SIZE                                0x1
#define _RX5PPS_RX5PPS5_LENGTH                              0x1
#define _RX5PPS_RX5PPS5_MASK                                0x20

// Register: CK5PPS
#define CK5PPS CK5PPS
extern volatile unsigned char           CK5PPS              __at(0xE18);
#ifndef _LIB_BUILD
asm("CK5PPS equ 0E18h");
#endif
// aliases
extern volatile unsigned char           TX5PPS              __at(0xE18);
#ifndef _LIB_BUILD
asm("TX5PPS equ 0E18h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PIN                    :3;
        unsigned PORT                   :3;
    };
    struct {
        unsigned TX5PPS                 :6;
    };
    struct {
        unsigned TX5PPS0                :1;
        unsigned TX5PPS1                :1;
        unsigned TX5PPS2                :1;
        unsigned TX5PPS3                :1;
        unsigned TX5PPS4                :1;
        unsigned TX5PPS5                :1;
    };
} CK5PPSbits_t;
extern volatile CK5PPSbits_t CK5PPSbits __at(0xE18);
// bitfield macros
#define _CK5PPS_PIN_POSN                                    0x0
#define _CK5PPS_PIN_POSITION                                0x0
#define _CK5PPS_PIN_SIZE                                    0x3
#define _CK5PPS_PIN_LENGTH                                  0x3
#define _CK5PPS_PIN_MASK                                    0x7
#define _CK5PPS_PORT_POSN                                   0x3
#define _CK5PPS_PORT_POSITION                               0x3
#define _CK5PPS_PORT_SIZE                                   0x3
#define _CK5PPS_PORT_LENGTH                                 0x3
#define _CK5PPS_PORT_MASK                                   0x38
#define _CK5PPS_TX5PPS_POSN                                 0x0
#define _CK5PPS_TX5PPS_POSITION                             0x0
#define _CK5PPS_TX5PPS_SIZE                                 0x6
#define _CK5PPS_TX5PPS_LENGTH                               0x6
#define _CK5PPS_TX5PPS_MASK                                 0x3F
#define _CK5PPS_TX5PPS0_POSN                                0x0
#define _CK5PPS_TX5PPS0_POSITION                            0x0
#define _CK5PPS_TX5PPS0_SIZE                                0x1
#define _CK5PPS_TX5PPS0_LENGTH                              0x1
#define _CK5PPS_TX5PPS0_MASK                                0x1
#define _CK5PPS_TX5PPS1_POSN                                0x1
#define _CK5PPS_TX5PPS1_POSITION                            0x1
#define _CK5PPS_TX5PPS1_SIZE                                0x1
#define _CK5PPS_TX5PPS1_LENGTH                              0x1
#define _CK5PPS_TX5PPS1_MASK                                0x2
#define _CK5PPS_TX5PPS2_POSN                                0x2
#define _CK5PPS_TX5PPS2_POSITION                            0x2
#define _CK5PPS_TX5PPS2_SIZE                                0x1
#define _CK5PPS_TX5PPS2_LENGTH                              0x1
#define _CK5PPS_TX5PPS2_MASK                                0x4
#define _CK5PPS_TX5PPS3_POSN                                0x3
#define _CK5PPS_TX5PPS3_POSITION                            0x3
#define _CK5PPS_TX5PPS3_SIZE                                0x1
#define _CK5PPS_TX5PPS3_LENGTH                              0x1
#define _CK5PPS_TX5PPS3_MASK                                0x8
#define _CK5PPS_TX5PPS4_POSN                                0x4
#define _CK5PPS_TX5PPS4_POSITION                            0x4
#define _CK5PPS_TX5PPS4_SIZE                                0x1
#define _CK5PPS_TX5PPS4_LENGTH                              0x1
#define _CK5PPS_TX5PPS4_MASK                                0x10
#define _CK5PPS_TX5PPS5_POSN                                0x5
#define _CK5PPS_TX5PPS5_POSITION                            0x5
#define _CK5PPS_TX5PPS5_SIZE                                0x1
#define _CK5PPS_TX5PPS5_LENGTH                              0x1
#define _CK5PPS_TX5PPS5_MASK                                0x20
// alias bitfield definitions
typedef union {
    struct {
        unsigned PIN                    :3;
        unsigned PORT                   :3;
    };
    struct {
        unsigned TX5PPS                 :6;
    };
    struct {
        unsigned TX5PPS0                :1;
        unsigned TX5PPS1                :1;
        unsigned TX5PPS2                :1;
        unsigned TX5PPS3                :1;
        unsigned TX5PPS4                :1;
        unsigned TX5PPS5                :1;
    };
} TX5PPSbits_t;
extern volatile TX5PPSbits_t TX5PPSbits __at(0xE18);
// bitfield macros
#define _TX5PPS_PIN_POSN                                    0x0
#define _TX5PPS_PIN_POSITION                                0x0
#define _TX5PPS_PIN_SIZE                                    0x3
#define _TX5PPS_PIN_LENGTH                                  0x3
#define _TX5PPS_PIN_MASK                                    0x7
#define _TX5PPS_PORT_POSN                                   0x3
#define _TX5PPS_PORT_POSITION                               0x3
#define _TX5PPS_PORT_SIZE                                   0x3
#define _TX5PPS_PORT_LENGTH                                 0x3
#define _TX5PPS_PORT_MASK                                   0x38
#define _TX5PPS_TX5PPS_POSN                                 0x0
#define _TX5PPS_TX5PPS_POSITION                             0x0
#define _TX5PPS_TX5PPS_SIZE                                 0x6
#define _TX5PPS_TX5PPS_LENGTH                               0x6
#define _TX5PPS_TX5PPS_MASK                                 0x3F
#define _TX5PPS_TX5PPS0_POSN                                0x0
#define _TX5PPS_TX5PPS0_POSITION                            0x0
#define _TX5PPS_TX5PPS0_SIZE                                0x1
#define _TX5PPS_TX5PPS0_LENGTH                              0x1
#define _TX5PPS_TX5PPS0_MASK                                0x1
#define _TX5PPS_TX5PPS1_POSN                                0x1
#define _TX5PPS_TX5PPS1_POSITION                            0x1
#define _TX5PPS_TX5PPS1_SIZE                                0x1
#define _TX5PPS_TX5PPS1_LENGTH                              0x1
#define _TX5PPS_TX5PPS1_MASK                                0x2
#define _TX5PPS_TX5PPS2_POSN                                0x2
#define _TX5PPS_TX5PPS2_POSITION                            0x2
#define _TX5PPS_TX5PPS2_SIZE                                0x1
#define _TX5PPS_TX5PPS2_LENGTH                              0x1
#define _TX5PPS_TX5PPS2_MASK                                0x4
#define _TX5PPS_TX5PPS3_POSN                                0x3
#define _TX5PPS_TX5PPS3_POSITION                            0x3
#define _TX5PPS_TX5PPS3_SIZE                                0x1
#define _TX5PPS_TX5PPS3_LENGTH                              0x1
#define _TX5PPS_TX5PPS3_MASK                                0x8
#define _TX5PPS_TX5PPS4_POSN                                0x4
#define _TX5PPS_TX5PPS4_POSITION                            0x4
#define _TX5PPS_TX5PPS4_SIZE                                0x1
#define _TX5PPS_TX5PPS4_LENGTH                              0x1
#define _TX5PPS_TX5PPS4_MASK                                0x10
#define _TX5PPS_TX5PPS5_POSN                                0x5
#define _TX5PPS_TX5PPS5_POSITION                            0x5
#define _TX5PPS_TX5PPS5_SIZE                                0x1
#define _TX5PPS_TX5PPS5_LENGTH                              0x1
#define _TX5PPS_TX5PPS5_MASK                                0x20

