GopalSaraf/Practicals/PSDL/include/proc/pic18lf66k40.h
extern volatile PIE7bits_t PIE7bits __at(0xE30);
// bitfield macros
#define _PIE7_CCP1IE_POSN                                   0x0
#define _PIE7_CCP1IE_POSITION                               0x0
#define _PIE7_CCP1IE_SIZE                                   0x1
#define _PIE7_CCP1IE_LENGTH                                 0x1
#define _PIE7_CCP1IE_MASK                                   0x1
#define _PIE7_CCP2IE_POSN                                   0x1
#define _PIE7_CCP2IE_POSITION                               0x1
#define _PIE7_CCP2IE_SIZE                                   0x1
#define _PIE7_CCP2IE_LENGTH                                 0x1
#define _PIE7_CCP2IE_MASK                                   0x2
#define _PIE7_CCP3IE_POSN                                   0x2
#define _PIE7_CCP3IE_POSITION                               0x2
#define _PIE7_CCP3IE_SIZE                                   0x1
#define _PIE7_CCP3IE_LENGTH                                 0x1
#define _PIE7_CCP3IE_MASK                                   0x4
#define _PIE7_CCP4IE_POSN                                   0x3
#define _PIE7_CCP4IE_POSITION                               0x3
#define _PIE7_CCP4IE_SIZE                                   0x1
#define _PIE7_CCP4IE_LENGTH                                 0x1
#define _PIE7_CCP4IE_MASK                                   0x8
#define _PIE7_CCP5IE_POSN                                   0x4
#define _PIE7_CCP5IE_POSITION                               0x4
#define _PIE7_CCP5IE_SIZE                                   0x1
#define _PIE7_CCP5IE_LENGTH                                 0x1
#define _PIE7_CCP5IE_MASK                                   0x10

// Register: PIE8
#define PIE8 PIE8
extern volatile unsigned char           PIE8                __at(0xE31);
#ifndef _LIB_BUILD
asm("PIE8 equ 0E31h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CWG1IE                 :1;
        unsigned                        :4;
        unsigned NVMIE                  :1;
        unsigned CRCIE                  :1;
        unsigned SCANIE                 :1;
    };
} PIE8bits_t;
extern volatile PIE8bits_t PIE8bits __at(0xE31);
// bitfield macros
#define _PIE8_CWG1IE_POSN                                   0x0
#define _PIE8_CWG1IE_POSITION                               0x0
#define _PIE8_CWG1IE_SIZE                                   0x1
#define _PIE8_CWG1IE_LENGTH                                 0x1
#define _PIE8_CWG1IE_MASK                                   0x1
#define _PIE8_NVMIE_POSN                                    0x5
#define _PIE8_NVMIE_POSITION                                0x5
#define _PIE8_NVMIE_SIZE                                    0x1
#define _PIE8_NVMIE_LENGTH                                  0x1
#define _PIE8_NVMIE_MASK                                    0x20
#define _PIE8_CRCIE_POSN                                    0x6
#define _PIE8_CRCIE_POSITION                                0x6
#define _PIE8_CRCIE_SIZE                                    0x1
#define _PIE8_CRCIE_LENGTH                                  0x1
#define _PIE8_CRCIE_MASK                                    0x40
#define _PIE8_SCANIE_POSN                                   0x7
#define _PIE8_SCANIE_POSITION                               0x7
#define _PIE8_SCANIE_SIZE                                   0x1
#define _PIE8_SCANIE_LENGTH                                 0x1
#define _PIE8_SCANIE_MASK                                   0x80

// Register: PIE9
#define PIE9 PIE9
extern volatile unsigned char           PIE9                __at(0xE32);
#ifndef _LIB_BUILD
asm("PIE9 equ 0E32h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SMT1IE                 :1;
        unsigned SMT1PRAIE              :1;
        unsigned SMT1PWAIE              :1;
        unsigned SMT2IE                 :1;
        unsigned SMT2PRAIE              :1;
        unsigned SMT2PWAIE              :1;
    };
} PIE9bits_t;
extern volatile PIE9bits_t PIE9bits __at(0xE32);
// bitfield macros
#define _PIE9_SMT1IE_POSN                                   0x0
#define _PIE9_SMT1IE_POSITION                               0x0
#define _PIE9_SMT1IE_SIZE                                   0x1
#define _PIE9_SMT1IE_LENGTH                                 0x1
#define _PIE9_SMT1IE_MASK                                   0x1
#define _PIE9_SMT1PRAIE_POSN                                0x1
#define _PIE9_SMT1PRAIE_POSITION                            0x1
#define _PIE9_SMT1PRAIE_SIZE                                0x1
#define _PIE9_SMT1PRAIE_LENGTH                              0x1
#define _PIE9_SMT1PRAIE_MASK                                0x2
#define _PIE9_SMT1PWAIE_POSN                                0x2
#define _PIE9_SMT1PWAIE_POSITION                            0x2
#define _PIE9_SMT1PWAIE_SIZE                                0x1
#define _PIE9_SMT1PWAIE_LENGTH                              0x1
#define _PIE9_SMT1PWAIE_MASK                                0x4
#define _PIE9_SMT2IE_POSN                                   0x3
#define _PIE9_SMT2IE_POSITION                               0x3
#define _PIE9_SMT2IE_SIZE                                   0x1
#define _PIE9_SMT2IE_LENGTH                                 0x1
#define _PIE9_SMT2IE_MASK                                   0x8
#define _PIE9_SMT2PRAIE_POSN                                0x4
#define _PIE9_SMT2PRAIE_POSITION                            0x4
#define _PIE9_SMT2PRAIE_SIZE                                0x1
#define _PIE9_SMT2PRAIE_LENGTH                              0x1
#define _PIE9_SMT2PRAIE_MASK                                0x10
#define _PIE9_SMT2PWAIE_POSN                                0x5
#define _PIE9_SMT2PWAIE_POSITION                            0x5
#define _PIE9_SMT2PWAIE_SIZE                                0x1
#define _PIE9_SMT2PWAIE_LENGTH                              0x1
#define _PIE9_SMT2PWAIE_MASK                                0x20

// Register: PIR0
#define PIR0 PIR0
extern volatile unsigned char           PIR0                __at(0xE33);
#ifndef _LIB_BUILD
asm("PIR0 equ 0E33h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned INT0IF                 :1;
        unsigned INT1IF                 :1;
        unsigned INT2IF                 :1;
        unsigned INT3IF                 :1;
        unsigned IOCIF                  :1;
        unsigned TMR0IF                 :1;
    };
} PIR0bits_t;
extern volatile PIR0bits_t PIR0bits __at(0xE33);
// bitfield macros
#define _PIR0_INT0IF_POSN                                   0x0
#define _PIR0_INT0IF_POSITION                               0x0
#define _PIR0_INT0IF_SIZE                                   0x1
#define _PIR0_INT0IF_LENGTH                                 0x1
#define _PIR0_INT0IF_MASK                                   0x1
#define _PIR0_INT1IF_POSN                                   0x1
#define _PIR0_INT1IF_POSITION                               0x1
#define _PIR0_INT1IF_SIZE                                   0x1
#define _PIR0_INT1IF_LENGTH                                 0x1
#define _PIR0_INT1IF_MASK                                   0x2
#define _PIR0_INT2IF_POSN                                   0x2
#define _PIR0_INT2IF_POSITION                               0x2
#define _PIR0_INT2IF_SIZE                                   0x1
#define _PIR0_INT2IF_LENGTH                                 0x1
#define _PIR0_INT2IF_MASK                                   0x4
#define _PIR0_INT3IF_POSN                                   0x3
#define _PIR0_INT3IF_POSITION                               0x3
#define _PIR0_INT3IF_SIZE                                   0x1
#define _PIR0_INT3IF_LENGTH                                 0x1
#define _PIR0_INT3IF_MASK                                   0x8
#define _PIR0_IOCIF_POSN                                    0x4
#define _PIR0_IOCIF_POSITION                                0x4
#define _PIR0_IOCIF_SIZE                                    0x1
#define _PIR0_IOCIF_LENGTH                                  0x1
#define _PIR0_IOCIF_MASK                                    0x10
#define _PIR0_TMR0IF_POSN                                   0x5
#define _PIR0_TMR0IF_POSITION                               0x5
#define _PIR0_TMR0IF_SIZE                                   0x1
#define _PIR0_TMR0IF_LENGTH                                 0x1
#define _PIR0_TMR0IF_MASK                                   0x20

// Register: PIR1
#define PIR1 PIR1
extern volatile unsigned char           PIR1                __at(0xE34);
#ifndef _LIB_BUILD
asm("PIR1 equ 0E34h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ADIF                   :1;
        unsigned ADTIF                  :1;
        unsigned                        :4;
        unsigned CSWIF                  :1;
        unsigned OSCFIF                 :1;
    };
    struct {
        unsigned                        :7;
        unsigned PSPIF                  :1;
    };
} PIR1bits_t;
extern volatile PIR1bits_t PIR1bits __at(0xE34);
// bitfield macros
#define _PIR1_ADIF_POSN                                     0x0
#define _PIR1_ADIF_POSITION                                 0x0
#define _PIR1_ADIF_SIZE                                     0x1
#define _PIR1_ADIF_LENGTH                                   0x1
#define _PIR1_ADIF_MASK                                     0x1
#define _PIR1_ADTIF_POSN                                    0x1
#define _PIR1_ADTIF_POSITION                                0x1
#define _PIR1_ADTIF_SIZE                                    0x1
#define _PIR1_ADTIF_LENGTH                                  0x1
#define _PIR1_ADTIF_MASK                                    0x2
#define _PIR1_CSWIF_POSN                                    0x6
#define _PIR1_CSWIF_POSITION                                0x6
#define _PIR1_CSWIF_SIZE                                    0x1
#define _PIR1_CSWIF_LENGTH                                  0x1
#define _PIR1_CSWIF_MASK                                    0x40
#define _PIR1_OSCFIF_POSN                                   0x7
#define _PIR1_OSCFIF_POSITION                               0x7
#define _PIR1_OSCFIF_SIZE                                   0x1
#define _PIR1_OSCFIF_LENGTH                                 0x1
#define _PIR1_OSCFIF_MASK                                   0x80
#define _PIR1_PSPIF_POSN                                    0x7
#define _PIR1_PSPIF_POSITION                                0x7
#define _PIR1_PSPIF_SIZE                                    0x1
#define _PIR1_PSPIF_LENGTH                                  0x1
#define _PIR1_PSPIF_MASK                                    0x80

// Register: PIR2
#define PIR2 PIR2
extern volatile unsigned char           PIR2                __at(0xE35);
#ifndef _LIB_BUILD
asm("PIR2 equ 0E35h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned C1IF                   :1;
        unsigned C2IF                   :1;
        unsigned C3IF                   :1;
        unsigned                        :3;
        unsigned ZCDIF                  :1;
        unsigned HLVDIF                 :1;
    };
    struct {
        unsigned                        :6;
        unsigned CMIF                   :1;
    };
} PIR2bits_t;
extern volatile PIR2bits_t PIR2bits __at(0xE35);
// bitfield macros
#define _PIR2_C1IF_POSN                                     0x0
#define _PIR2_C1IF_POSITION                                 0x0
#define _PIR2_C1IF_SIZE                                     0x1
#define _PIR2_C1IF_LENGTH                                   0x1
#define _PIR2_C1IF_MASK                                     0x1
#define _PIR2_C2IF_POSN                                     0x1
#define _PIR2_C2IF_POSITION                                 0x1
#define _PIR2_C2IF_SIZE                                     0x1
#define _PIR2_C2IF_LENGTH                                   0x1
#define _PIR2_C2IF_MASK                                     0x2
#define _PIR2_C3IF_POSN                                     0x2
#define _PIR2_C3IF_POSITION                                 0x2
#define _PIR2_C3IF_SIZE                                     0x1
#define _PIR2_C3IF_LENGTH                                   0x1
#define _PIR2_C3IF_MASK                                     0x4
#define _PIR2_ZCDIF_POSN                                    0x6
#define _PIR2_ZCDIF_POSITION                                0x6
#define _PIR2_ZCDIF_SIZE                                    0x1
#define _PIR2_ZCDIF_LENGTH                                  0x1
#define _PIR2_ZCDIF_MASK                                    0x40
#define _PIR2_HLVDIF_POSN                                   0x7
#define _PIR2_HLVDIF_POSITION                               0x7
#define _PIR2_HLVDIF_SIZE                                   0x1
#define _PIR2_HLVDIF_LENGTH                                 0x1
#define _PIR2_HLVDIF_MASK                                   0x80
#define _PIR2_CMIF_POSN                                     0x6
#define _PIR2_CMIF_POSITION                                 0x6
#define _PIR2_CMIF_SIZE                                     0x1
#define _PIR2_CMIF_LENGTH                                   0x1
#define _PIR2_CMIF_MASK                                     0x40

// Register: PIR3
#define PIR3 PIR3
extern volatile unsigned char           PIR3                __at(0xE36);
#ifndef _LIB_BUILD
asm("PIR3 equ 0E36h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SSP1IF                 :1;
        unsigned BCL1IF                 :1;
        unsigned SSP2IF                 :1;
        unsigned BCL2IF                 :1;
        unsigned TX1IF                  :1;
        unsigned RC1IF                  :1;
        unsigned TX2IF                  :1;
        unsigned RC2IF                  :1;
    };
    struct {
        unsigned                        :1;
        unsigned RXBNIF                 :1;
        unsigned                        :2;
        unsigned TXBNIF                 :1;
    };
} PIR3bits_t;
extern volatile PIR3bits_t PIR3bits __at(0xE36);
// bitfield macros
#define _PIR3_SSP1IF_POSN                                   0x0
#define _PIR3_SSP1IF_POSITION                               0x0
#define _PIR3_SSP1IF_SIZE                                   0x1
#define _PIR3_SSP1IF_LENGTH                                 0x1
#define _PIR3_SSP1IF_MASK                                   0x1
#define _PIR3_BCL1IF_POSN                                   0x1
#define _PIR3_BCL1IF_POSITION                               0x1
#define _PIR3_BCL1IF_SIZE                                   0x1
#define _PIR3_BCL1IF_LENGTH                                 0x1
#define _PIR3_BCL1IF_MASK                                   0x2
#define _PIR3_SSP2IF_POSN                                   0x2
#define _PIR3_SSP2IF_POSITION                               0x2
#define _PIR3_SSP2IF_SIZE                                   0x1
#define _PIR3_SSP2IF_LENGTH                                 0x1
#define _PIR3_SSP2IF_MASK                                   0x4
#define _PIR3_BCL2IF_POSN                                   0x3
#define _PIR3_BCL2IF_POSITION                               0x3
#define _PIR3_BCL2IF_SIZE                                   0x1
#define _PIR3_BCL2IF_LENGTH                                 0x1
#define _PIR3_BCL2IF_MASK                                   0x8
#define _PIR3_TX1IF_POSN                                    0x4
#define _PIR3_TX1IF_POSITION                                0x4
#define _PIR3_TX1IF_SIZE                                    0x1
#define _PIR3_TX1IF_LENGTH                                  0x1
#define _PIR3_TX1IF_MASK                                    0x10
#define _PIR3_RC1IF_POSN                                    0x5
#define _PIR3_RC1IF_POSITION                                0x5
#define _PIR3_RC1IF_SIZE                                    0x1
#define _PIR3_RC1IF_LENGTH                                  0x1
#define _PIR3_RC1IF_MASK                                    0x20
#define _PIR3_TX2IF_POSN                                    0x6
#define _PIR3_TX2IF_POSITION                                0x6
#define _PIR3_TX2IF_SIZE                                    0x1
#define _PIR3_TX2IF_LENGTH                                  0x1
#define _PIR3_TX2IF_MASK                                    0x40
#define _PIR3_RC2IF_POSN                                    0x7
#define _PIR3_RC2IF_POSITION                                0x7
#define _PIR3_RC2IF_SIZE                                    0x1
#define _PIR3_RC2IF_LENGTH                                  0x1
#define _PIR3_RC2IF_MASK                                    0x80
#define _PIR3_RXBNIF_POSN                                   0x1
#define _PIR3_RXBNIF_POSITION                               0x1
#define _PIR3_RXBNIF_SIZE                                   0x1
#define _PIR3_RXBNIF_LENGTH                                 0x1
#define _PIR3_RXBNIF_MASK                                   0x2
#define _PIR3_TXBNIF_POSN                                   0x4
#define _PIR3_TXBNIF_POSITION                               0x4
#define _PIR3_TXBNIF_SIZE                                   0x1
#define _PIR3_TXBNIF_LENGTH                                 0x1
#define _PIR3_TXBNIF_MASK                                   0x10

// Register: PIR4
#define PIR4 PIR4
extern volatile unsigned char           PIR4                __at(0xE37);
#ifndef _LIB_BUILD
asm("PIR4 equ 0E37h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TX3IF                  :1;
        unsigned RC3IF                  :1;
        unsigned TX4IF                  :1;
        unsigned RC4IF                  :1;
        unsigned TX5IF                  :1;
        unsigned RC5IF                  :1;
    };
} PIR4bits_t;
