GopalSaraf/Practicals/PSDL/include/proc/pic18lf66k40.h
extern volatile RCSTA3bits_t RCSTA3bits __at(0xEEE);
// bitfield macros
#define _RCSTA3_RX9D_POSN                                   0x0
#define _RCSTA3_RX9D_POSITION                               0x0
#define _RCSTA3_RX9D_SIZE                                   0x1
#define _RCSTA3_RX9D_LENGTH                                 0x1
#define _RCSTA3_RX9D_MASK                                   0x1
#define _RCSTA3_OERR_POSN                                   0x1
#define _RCSTA3_OERR_POSITION                               0x1
#define _RCSTA3_OERR_SIZE                                   0x1
#define _RCSTA3_OERR_LENGTH                                 0x1
#define _RCSTA3_OERR_MASK                                   0x2
#define _RCSTA3_FERR_POSN                                   0x2
#define _RCSTA3_FERR_POSITION                               0x2
#define _RCSTA3_FERR_SIZE                                   0x1
#define _RCSTA3_FERR_LENGTH                                 0x1
#define _RCSTA3_FERR_MASK                                   0x4
#define _RCSTA3_ADDEN_POSN                                  0x3
#define _RCSTA3_ADDEN_POSITION                              0x3
#define _RCSTA3_ADDEN_SIZE                                  0x1
#define _RCSTA3_ADDEN_LENGTH                                0x1
#define _RCSTA3_ADDEN_MASK                                  0x8
#define _RCSTA3_CREN_POSN                                   0x4
#define _RCSTA3_CREN_POSITION                               0x4
#define _RCSTA3_CREN_SIZE                                   0x1
#define _RCSTA3_CREN_LENGTH                                 0x1
#define _RCSTA3_CREN_MASK                                   0x10
#define _RCSTA3_SREN_POSN                                   0x5
#define _RCSTA3_SREN_POSITION                               0x5
#define _RCSTA3_SREN_SIZE                                   0x1
#define _RCSTA3_SREN_LENGTH                                 0x1
#define _RCSTA3_SREN_MASK                                   0x20
#define _RCSTA3_RX9_POSN                                    0x6
#define _RCSTA3_RX9_POSITION                                0x6
#define _RCSTA3_RX9_SIZE                                    0x1
#define _RCSTA3_RX9_LENGTH                                  0x1
#define _RCSTA3_RX9_MASK                                    0x40
#define _RCSTA3_SPEN_POSN                                   0x7
#define _RCSTA3_SPEN_POSITION                               0x7
#define _RCSTA3_SPEN_SIZE                                   0x1
#define _RCSTA3_SPEN_LENGTH                                 0x1
#define _RCSTA3_SPEN_MASK                                   0x80

// Register: TX3STA
#define TX3STA TX3STA
extern volatile unsigned char           TX3STA              __at(0xEEF);
#ifndef _LIB_BUILD
asm("TX3STA equ 0EEFh");
#endif
// aliases
extern volatile unsigned char           TXSTA3              __at(0xEEF);
#ifndef _LIB_BUILD
asm("TXSTA3 equ 0EEFh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TX9D                   :1;
        unsigned TRMT                   :1;
        unsigned BRGH                   :1;
        unsigned SENDB                  :1;
        unsigned SYNC                   :1;
        unsigned TXEN                   :1;
        unsigned TX9                    :1;
        unsigned CSRC                   :1;
    };
} TX3STAbits_t;
extern volatile TX3STAbits_t TX3STAbits __at(0xEEF);
// bitfield macros
#define _TX3STA_TX9D_POSN                                   0x0
#define _TX3STA_TX9D_POSITION                               0x0
#define _TX3STA_TX9D_SIZE                                   0x1
#define _TX3STA_TX9D_LENGTH                                 0x1
#define _TX3STA_TX9D_MASK                                   0x1
#define _TX3STA_TRMT_POSN                                   0x1
#define _TX3STA_TRMT_POSITION                               0x1
#define _TX3STA_TRMT_SIZE                                   0x1
#define _TX3STA_TRMT_LENGTH                                 0x1
#define _TX3STA_TRMT_MASK                                   0x2
#define _TX3STA_BRGH_POSN                                   0x2
#define _TX3STA_BRGH_POSITION                               0x2
#define _TX3STA_BRGH_SIZE                                   0x1
#define _TX3STA_BRGH_LENGTH                                 0x1
#define _TX3STA_BRGH_MASK                                   0x4
#define _TX3STA_SENDB_POSN                                  0x3
#define _TX3STA_SENDB_POSITION                              0x3
#define _TX3STA_SENDB_SIZE                                  0x1
#define _TX3STA_SENDB_LENGTH                                0x1
#define _TX3STA_SENDB_MASK                                  0x8
#define _TX3STA_SYNC_POSN                                   0x4
#define _TX3STA_SYNC_POSITION                               0x4
#define _TX3STA_SYNC_SIZE                                   0x1
#define _TX3STA_SYNC_LENGTH                                 0x1
#define _TX3STA_SYNC_MASK                                   0x10
#define _TX3STA_TXEN_POSN                                   0x5
#define _TX3STA_TXEN_POSITION                               0x5
#define _TX3STA_TXEN_SIZE                                   0x1
#define _TX3STA_TXEN_LENGTH                                 0x1
#define _TX3STA_TXEN_MASK                                   0x20
#define _TX3STA_TX9_POSN                                    0x6
#define _TX3STA_TX9_POSITION                                0x6
#define _TX3STA_TX9_SIZE                                    0x1
#define _TX3STA_TX9_LENGTH                                  0x1
#define _TX3STA_TX9_MASK                                    0x40
#define _TX3STA_CSRC_POSN                                   0x7
#define _TX3STA_CSRC_POSITION                               0x7
#define _TX3STA_CSRC_SIZE                                   0x1
#define _TX3STA_CSRC_LENGTH                                 0x1
#define _TX3STA_CSRC_MASK                                   0x80
// alias bitfield definitions
typedef union {
    struct {
        unsigned TX9D                   :1;
        unsigned TRMT                   :1;
        unsigned BRGH                   :1;
        unsigned SENDB                  :1;
        unsigned SYNC                   :1;
        unsigned TXEN                   :1;
        unsigned TX9                    :1;
        unsigned CSRC                   :1;
    };
} TXSTA3bits_t;
extern volatile TXSTA3bits_t TXSTA3bits __at(0xEEF);
// bitfield macros
#define _TXSTA3_TX9D_POSN                                   0x0
#define _TXSTA3_TX9D_POSITION                               0x0
#define _TXSTA3_TX9D_SIZE                                   0x1
#define _TXSTA3_TX9D_LENGTH                                 0x1
#define _TXSTA3_TX9D_MASK                                   0x1
#define _TXSTA3_TRMT_POSN                                   0x1
#define _TXSTA3_TRMT_POSITION                               0x1
#define _TXSTA3_TRMT_SIZE                                   0x1
#define _TXSTA3_TRMT_LENGTH                                 0x1
#define _TXSTA3_TRMT_MASK                                   0x2
#define _TXSTA3_BRGH_POSN                                   0x2
#define _TXSTA3_BRGH_POSITION                               0x2
#define _TXSTA3_BRGH_SIZE                                   0x1
#define _TXSTA3_BRGH_LENGTH                                 0x1
#define _TXSTA3_BRGH_MASK                                   0x4
#define _TXSTA3_SENDB_POSN                                  0x3
#define _TXSTA3_SENDB_POSITION                              0x3
#define _TXSTA3_SENDB_SIZE                                  0x1
#define _TXSTA3_SENDB_LENGTH                                0x1
#define _TXSTA3_SENDB_MASK                                  0x8
#define _TXSTA3_SYNC_POSN                                   0x4
#define _TXSTA3_SYNC_POSITION                               0x4
#define _TXSTA3_SYNC_SIZE                                   0x1
#define _TXSTA3_SYNC_LENGTH                                 0x1
#define _TXSTA3_SYNC_MASK                                   0x10
#define _TXSTA3_TXEN_POSN                                   0x5
#define _TXSTA3_TXEN_POSITION                               0x5
#define _TXSTA3_TXEN_SIZE                                   0x1
#define _TXSTA3_TXEN_LENGTH                                 0x1
#define _TXSTA3_TXEN_MASK                                   0x20
#define _TXSTA3_TX9_POSN                                    0x6
#define _TXSTA3_TX9_POSITION                                0x6
#define _TXSTA3_TX9_SIZE                                    0x1
#define _TXSTA3_TX9_LENGTH                                  0x1
#define _TXSTA3_TX9_MASK                                    0x40
#define _TXSTA3_CSRC_POSN                                   0x7
#define _TXSTA3_CSRC_POSITION                               0x7
#define _TXSTA3_CSRC_SIZE                                   0x1
#define _TXSTA3_CSRC_LENGTH                                 0x1
#define _TXSTA3_CSRC_MASK                                   0x80

// Register: BAUD3CON
#define BAUD3CON BAUD3CON
extern volatile unsigned char           BAUD3CON            __at(0xEF0);
#ifndef _LIB_BUILD
asm("BAUD3CON equ 0EF0h");
#endif
// aliases
extern volatile unsigned char           BAUDCON3            __at(0xEF0);
#ifndef _LIB_BUILD
asm("BAUDCON3 equ 0EF0h");
#endif
extern volatile unsigned char           BAUDCTL3            __at(0xEF0);
#ifndef _LIB_BUILD
asm("BAUDCTL3 equ 0EF0h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ABDEN                  :1;
        unsigned WUE                    :1;
        unsigned                        :1;
        unsigned BRG16                  :1;
        unsigned SCKP                   :1;
        unsigned                        :1;
        unsigned RCIDL                  :1;
        unsigned ABDOVF                 :1;
    };
} BAUD3CONbits_t;
extern volatile BAUD3CONbits_t BAUD3CONbits __at(0xEF0);
// bitfield macros
#define _BAUD3CON_ABDEN_POSN                                0x0
#define _BAUD3CON_ABDEN_POSITION                            0x0
#define _BAUD3CON_ABDEN_SIZE                                0x1
#define _BAUD3CON_ABDEN_LENGTH                              0x1
#define _BAUD3CON_ABDEN_MASK                                0x1
#define _BAUD3CON_WUE_POSN                                  0x1
#define _BAUD3CON_WUE_POSITION                              0x1
#define _BAUD3CON_WUE_SIZE                                  0x1
#define _BAUD3CON_WUE_LENGTH                                0x1
#define _BAUD3CON_WUE_MASK                                  0x2
#define _BAUD3CON_BRG16_POSN                                0x3
#define _BAUD3CON_BRG16_POSITION                            0x3
#define _BAUD3CON_BRG16_SIZE                                0x1
#define _BAUD3CON_BRG16_LENGTH                              0x1
#define _BAUD3CON_BRG16_MASK                                0x8
#define _BAUD3CON_SCKP_POSN                                 0x4
#define _BAUD3CON_SCKP_POSITION                             0x4
#define _BAUD3CON_SCKP_SIZE                                 0x1
#define _BAUD3CON_SCKP_LENGTH                               0x1
#define _BAUD3CON_SCKP_MASK                                 0x10
#define _BAUD3CON_RCIDL_POSN                                0x6
#define _BAUD3CON_RCIDL_POSITION                            0x6
#define _BAUD3CON_RCIDL_SIZE                                0x1
#define _BAUD3CON_RCIDL_LENGTH                              0x1
#define _BAUD3CON_RCIDL_MASK                                0x40
#define _BAUD3CON_ABDOVF_POSN                               0x7
#define _BAUD3CON_ABDOVF_POSITION                           0x7
#define _BAUD3CON_ABDOVF_SIZE                               0x1
#define _BAUD3CON_ABDOVF_LENGTH                             0x1
#define _BAUD3CON_ABDOVF_MASK                               0x80
// alias bitfield definitions
typedef union {
    struct {
        unsigned ABDEN                  :1;
        unsigned WUE                    :1;
        unsigned                        :1;
        unsigned BRG16                  :1;
        unsigned SCKP                   :1;
        unsigned                        :1;
        unsigned RCIDL                  :1;
        unsigned ABDOVF                 :1;
    };
} BAUDCON3bits_t;
extern volatile BAUDCON3bits_t BAUDCON3bits __at(0xEF0);
// bitfield macros
#define _BAUDCON3_ABDEN_POSN                                0x0
#define _BAUDCON3_ABDEN_POSITION                            0x0
#define _BAUDCON3_ABDEN_SIZE                                0x1
#define _BAUDCON3_ABDEN_LENGTH                              0x1
#define _BAUDCON3_ABDEN_MASK                                0x1
#define _BAUDCON3_WUE_POSN                                  0x1
#define _BAUDCON3_WUE_POSITION                              0x1
#define _BAUDCON3_WUE_SIZE                                  0x1
#define _BAUDCON3_WUE_LENGTH                                0x1
#define _BAUDCON3_WUE_MASK                                  0x2
#define _BAUDCON3_BRG16_POSN                                0x3
#define _BAUDCON3_BRG16_POSITION                            0x3
#define _BAUDCON3_BRG16_SIZE                                0x1
#define _BAUDCON3_BRG16_LENGTH                              0x1
#define _BAUDCON3_BRG16_MASK                                0x8
#define _BAUDCON3_SCKP_POSN                                 0x4
#define _BAUDCON3_SCKP_POSITION                             0x4
#define _BAUDCON3_SCKP_SIZE                                 0x1
#define _BAUDCON3_SCKP_LENGTH                               0x1
#define _BAUDCON3_SCKP_MASK                                 0x10
#define _BAUDCON3_RCIDL_POSN                                0x6
#define _BAUDCON3_RCIDL_POSITION                            0x6
#define _BAUDCON3_RCIDL_SIZE                                0x1
#define _BAUDCON3_RCIDL_LENGTH                              0x1
#define _BAUDCON3_RCIDL_MASK                                0x40
#define _BAUDCON3_ABDOVF_POSN                               0x7
#define _BAUDCON3_ABDOVF_POSITION                           0x7
#define _BAUDCON3_ABDOVF_SIZE                               0x1
#define _BAUDCON3_ABDOVF_LENGTH                             0x1
#define _BAUDCON3_ABDOVF_MASK                               0x80
typedef union {
    struct {
        unsigned ABDEN                  :1;
        unsigned WUE                    :1;
        unsigned                        :1;
        unsigned BRG16                  :1;
        unsigned SCKP                   :1;
        unsigned                        :1;
        unsigned RCIDL                  :1;
        unsigned ABDOVF                 :1;
    };
} BAUDCTL3bits_t;
