GopalSaraf/Practicals/PSDL/include/proc/pic18lf66k40.h
extern volatile __bit                   CLPOL               __at(0x7A91);	// @ (0xF52 * 8 + 1)
#define                                 CLPOL_bit           _BIT_ACCESS(MDCON1,1)
// MDCARL<CLS0>
extern volatile __bit                   CLS0                __at(0x7AA0);	// @ (0xF54 * 8 + 0)
#define                                 CLS0_bit            _BIT_ACCESS(MDCARL,0)
// MDCARL<CLS1>
extern volatile __bit                   CLS1                __at(0x7AA1);	// @ (0xF54 * 8 + 1)
#define                                 CLS1_bit            _BIT_ACCESS(MDCARL,1)
// MDCARL<CLS2>
extern volatile __bit                   CLS2                __at(0x7AA2);	// @ (0xF54 * 8 + 2)
#define                                 CLS2_bit            _BIT_ACCESS(MDCARL,2)
// MDCARL<CLS3>
extern volatile __bit                   CLS3                __at(0x7AA3);	// @ (0xF54 * 8 + 3)
#define                                 CLS3_bit            _BIT_ACCESS(MDCARL,3)
// MDCON1<CLSYNC>
extern volatile __bit                   CLSYNC              __at(0x7A90);	// @ (0xF52 * 8 + 0)
#define                                 CLSYNC_bit          _BIT_ACCESS(MDCON1,0)
// PIE2<CMIE>
extern volatile __bit                   CMIE                __at(0x715E);	// @ (0xE2B * 8 + 6)
#define                                 CMIE_bit            _BIT_ACCESS(PIE2,6)
// PIR2<CMIF>
extern volatile __bit                   CMIF                __at(0x71AE);	// @ (0xE35 * 8 + 6)
#define                                 CMIF_bit            _BIT_ACCESS(PIR2,6)
// IPR2<CMIP>
extern volatile __bit                   CMIP                __at(0x710E);	// @ (0xE21 * 8 + 6)
#define                                 CMIP_bit            _BIT_ACCESS(IPR2,6)
// PMD3<CMP1MD>
extern volatile __bit                   CMP1MD              __at(0x7279);	// @ (0xE4F * 8 + 1)
#define                                 CMP1MD_bit          _BIT_ACCESS(PMD3,1)
// PMD3<CMP2MD>
extern volatile __bit                   CMP2MD              __at(0x727A);	// @ (0xE4F * 8 + 2)
#define                                 CMP2MD_bit          _BIT_ACCESS(PMD3,2)
// PMD3<CMP3MD>
extern volatile __bit                   CMP3MD              __at(0x727B);	// @ (0xE4F * 8 + 3)
#define                                 CMP3MD_bit          _BIT_ACCESS(PMD3,3)
// OSCCON2<COSC0>
extern volatile __bit                   COSC0               __at(0x7224);	// @ (0xE44 * 8 + 4)
#define                                 COSC0_bit           _BIT_ACCESS(OSCCON2,4)
// OSCCON2<COSC1>
extern volatile __bit                   COSC1               __at(0x7225);	// @ (0xE44 * 8 + 5)
#define                                 COSC1_bit           _BIT_ACCESS(OSCCON2,5)
// OSCCON2<COSC2>
extern volatile __bit                   COSC2               __at(0x7226);	// @ (0xE44 * 8 + 6)
#define                                 COSC2_bit           _BIT_ACCESS(OSCCON2,6)
// CRCCON0<CRCEN>
extern volatile __bit                   CRCEN               __at(0x7A3F);	// @ (0xF47 * 8 + 7)
#define                                 CRCEN_bit           _BIT_ACCESS(CRCCON0,7)
// CRCCON0<CRCGO>
extern volatile __bit                   CRCGO               __at(0x7A3E);	// @ (0xF47 * 8 + 6)
#define                                 CRCGO_bit           _BIT_ACCESS(CRCCON0,6)
// PIE8<CRCIE>
extern volatile __bit                   CRCIE               __at(0x718E);	// @ (0xE31 * 8 + 6)
#define                                 CRCIE_bit           _BIT_ACCESS(PIE8,6)
// PIR8<CRCIF>
extern volatile __bit                   CRCIF               __at(0x71DE);	// @ (0xE3B * 8 + 6)
#define                                 CRCIF_bit           _BIT_ACCESS(PIR8,6)
// IPR8<CRCIP>
extern volatile __bit                   CRCIP               __at(0x713E);	// @ (0xE27 * 8 + 6)
#define                                 CRCIP_bit           _BIT_ACCESS(IPR8,6)
// PMD0<CRCMD>
extern volatile __bit                   CRCMD               __at(0x7264);	// @ (0xE4C * 8 + 4)
#define                                 CRCMD_bit           _BIT_ACCESS(PMD0,4)
// TX1STA<CSRC1>
extern volatile __bit                   CSRC1               __at(0x7CEF);	// @ (0xF9D * 8 + 7)
#define                                 CSRC1_bit           _BIT_ACCESS(TX1STA,7)
// OSCCON3<CSWHOLD>
extern volatile __bit                   CSWHOLD             __at(0x722F);	// @ (0xE45 * 8 + 7)
#define                                 CSWHOLD_bit         _BIT_ACCESS(OSCCON3,7)
// PIE1<CSWIE>
extern volatile __bit                   CSWIE               __at(0x7156);	// @ (0xE2A * 8 + 6)
#define                                 CSWIE_bit           _BIT_ACCESS(PIE1,6)
// PIR1<CSWIF>
extern volatile __bit                   CSWIF               __at(0x71A6);	// @ (0xE34 * 8 + 6)
#define                                 CSWIF_bit           _BIT_ACCESS(PIR1,6)
// IPR1<CSWIP>
extern volatile __bit                   CSWIP               __at(0x7106);	// @ (0xE20 * 8 + 6)
#define                                 CSWIP_bit           _BIT_ACCESS(IPR1,6)
// CWG1CLK<CWG1CS>
extern volatile __bit                   CWG1CS              __at(0x79B0);	// @ (0xF36 * 8 + 0)
#define                                 CWG1CS_bit          _BIT_ACCESS(CWG1CLK,0)
// CWG1DBF<CWG1DBF0>
extern volatile __bit                   CWG1DBF0            __at(0x79C8);	// @ (0xF39 * 8 + 0)
#define                                 CWG1DBF0_bit        _BIT_ACCESS(CWG1DBF,0)
// CWG1DBF<CWG1DBF1>
extern volatile __bit                   CWG1DBF1            __at(0x79C9);	// @ (0xF39 * 8 + 1)
#define                                 CWG1DBF1_bit        _BIT_ACCESS(CWG1DBF,1)
// CWG1DBF<CWG1DBF2>
extern volatile __bit                   CWG1DBF2            __at(0x79CA);	// @ (0xF39 * 8 + 2)
#define                                 CWG1DBF2_bit        _BIT_ACCESS(CWG1DBF,2)
// CWG1DBF<CWG1DBF3>
extern volatile __bit                   CWG1DBF3            __at(0x79CB);	// @ (0xF39 * 8 + 3)
#define                                 CWG1DBF3_bit        _BIT_ACCESS(CWG1DBF,3)
// CWG1DBF<CWG1DBF4>
extern volatile __bit                   CWG1DBF4            __at(0x79CC);	// @ (0xF39 * 8 + 4)
#define                                 CWG1DBF4_bit        _BIT_ACCESS(CWG1DBF,4)
// CWG1DBF<CWG1DBF5>
extern volatile __bit                   CWG1DBF5            __at(0x79CD);	// @ (0xF39 * 8 + 5)
#define                                 CWG1DBF5_bit        _BIT_ACCESS(CWG1DBF,5)
// CWG1DBR<CWG1DBR0>
extern volatile __bit                   CWG1DBR0            __at(0x79C0);	// @ (0xF38 * 8 + 0)
#define                                 CWG1DBR0_bit        _BIT_ACCESS(CWG1DBR,0)
// CWG1DBR<CWG1DBR1>
extern volatile __bit                   CWG1DBR1            __at(0x79C1);	// @ (0xF38 * 8 + 1)
#define                                 CWG1DBR1_bit        _BIT_ACCESS(CWG1DBR,1)
// CWG1DBR<CWG1DBR2>
extern volatile __bit                   CWG1DBR2            __at(0x79C2);	// @ (0xF38 * 8 + 2)
#define                                 CWG1DBR2_bit        _BIT_ACCESS(CWG1DBR,2)
// CWG1DBR<CWG1DBR3>
extern volatile __bit                   CWG1DBR3            __at(0x79C3);	// @ (0xF38 * 8 + 3)
#define                                 CWG1DBR3_bit        _BIT_ACCESS(CWG1DBR,3)
// CWG1DBR<CWG1DBR4>
extern volatile __bit                   CWG1DBR4            __at(0x79C4);	// @ (0xF38 * 8 + 4)
#define                                 CWG1DBR4_bit        _BIT_ACCESS(CWG1DBR,4)
// CWG1DBR<CWG1DBR5>
extern volatile __bit                   CWG1DBR5            __at(0x79C5);	// @ (0xF38 * 8 + 5)
#define                                 CWG1DBR5_bit        _BIT_ACCESS(CWG1DBR,5)
// CWG1CON0<CWG1EN>
extern volatile __bit                   CWG1EN              __at(0x79D7);	// @ (0xF3A * 8 + 7)
#define                                 CWG1EN_bit          _BIT_ACCESS(CWG1CON0,7)
// PIE8<CWG1IE>
extern volatile __bit                   CWG1IE              __at(0x7188);	// @ (0xE31 * 8 + 0)
#define                                 CWG1IE_bit          _BIT_ACCESS(PIE8,0)
// PIR8<CWG1IF>
extern volatile __bit                   CWG1IF              __at(0x71D8);	// @ (0xE3B * 8 + 0)
#define                                 CWG1IF_bit          _BIT_ACCESS(PIR8,0)
// CWG1CON1<CWG1IN>
extern volatile __bit                   CWG1IN              __at(0x79DD);	// @ (0xF3B * 8 + 5)
#define                                 CWG1IN_bit          _BIT_ACCESS(CWG1CON1,5)
// CWG1PPS<CWG1INPPS0>
extern volatile __bit                   CWG1INPPS0          __at(0x7058);	// @ (0xE0B * 8 + 0)
#define                                 CWG1INPPS0_bit      _BIT_ACCESS(CWG1PPS,0)
// CWG1PPS<CWG1INPPS1>
extern volatile __bit                   CWG1INPPS1          __at(0x7059);	// @ (0xE0B * 8 + 1)
#define                                 CWG1INPPS1_bit      _BIT_ACCESS(CWG1PPS,1)
// CWG1PPS<CWG1INPPS2>
extern volatile __bit                   CWG1INPPS2          __at(0x705A);	// @ (0xE0B * 8 + 2)
#define                                 CWG1INPPS2_bit      _BIT_ACCESS(CWG1PPS,2)
// CWG1PPS<CWG1INPPS3>
extern volatile __bit                   CWG1INPPS3          __at(0x705B);	// @ (0xE0B * 8 + 3)
#define                                 CWG1INPPS3_bit      _BIT_ACCESS(CWG1PPS,3)
// CWG1PPS<CWG1INPPS4>
extern volatile __bit                   CWG1INPPS4          __at(0x705C);	// @ (0xE0B * 8 + 4)
#define                                 CWG1INPPS4_bit      _BIT_ACCESS(CWG1PPS,4)
// IPR8<CWG1IP>
extern volatile __bit                   CWG1IP              __at(0x7138);	// @ (0xE27 * 8 + 0)
#define                                 CWG1IP_bit          _BIT_ACCESS(IPR8,0)
// CWG1ISM<CWG1ISM0>
extern volatile __bit                   CWG1ISM0            __at(0x79B8);	// @ (0xF37 * 8 + 0)
#define                                 CWG1ISM0_bit        _BIT_ACCESS(CWG1ISM,0)
// CWG1ISM<CWG1ISM1>
extern volatile __bit                   CWG1ISM1            __at(0x79B9);	// @ (0xF37 * 8 + 1)
#define                                 CWG1ISM1_bit        _BIT_ACCESS(CWG1ISM,1)
// CWG1ISM<CWG1ISM2>
extern volatile __bit                   CWG1ISM2            __at(0x79BA);	// @ (0xF37 * 8 + 2)
#define                                 CWG1ISM2_bit        _BIT_ACCESS(CWG1ISM,2)
// CWG1CON0<CWG1LD>
extern volatile __bit                   CWG1LD              __at(0x79D6);	// @ (0xF3A * 8 + 6)
#define                                 CWG1LD_bit          _BIT_ACCESS(CWG1CON0,6)
// CWG1AS0<CWG1LSAC0>
extern volatile __bit                   CWG1LSAC0           __at(0x79E2);	// @ (0xF3C * 8 + 2)
#define                                 CWG1LSAC0_bit       _BIT_ACCESS(CWG1AS0,2)
// CWG1AS0<CWG1LSAC1>
extern volatile __bit                   CWG1LSAC1           __at(0x79E3);	// @ (0xF3C * 8 + 3)
#define                                 CWG1LSAC1_bit       _BIT_ACCESS(CWG1AS0,3)
// CWG1AS0<CWG1LSBD0>
extern volatile __bit                   CWG1LSBD0           __at(0x79E4);	// @ (0xF3C * 8 + 4)
#define                                 CWG1LSBD0_bit       _BIT_ACCESS(CWG1AS0,4)
// CWG1AS0<CWG1LSBD1>
extern volatile __bit                   CWG1LSBD1           __at(0x79E5);	// @ (0xF3C * 8 + 5)
#define                                 CWG1LSBD1_bit       _BIT_ACCESS(CWG1AS0,5)
// PMD2<CWG1MD>
extern volatile __bit                   CWG1MD              __at(0x7275);	// @ (0xE4E * 8 + 5)
#define                                 CWG1MD_bit          _BIT_ACCESS(PMD2,5)
// CWG1CON0<CWG1MODE0>
extern volatile __bit                   CWG1MODE0           __at(0x79D0);	// @ (0xF3A * 8 + 0)
#define                                 CWG1MODE0_bit       _BIT_ACCESS(CWG1CON0,0)
// CWG1CON0<CWG1MODE1>
extern volatile __bit                   CWG1MODE1           __at(0x79D1);	// @ (0xF3A * 8 + 1)
#define                                 CWG1MODE1_bit       _BIT_ACCESS(CWG1CON0,1)
// CWG1CON0<CWG1MODE2>
extern volatile __bit                   CWG1MODE2           __at(0x79D2);	// @ (0xF3A * 8 + 2)
#define                                 CWG1MODE2_bit       _BIT_ACCESS(CWG1CON0,2)
// CWG1STR<CWG1OVRA>
extern volatile __bit                   CWG1OVRA            __at(0x79F4);	// @ (0xF3E * 8 + 4)
#define                                 CWG1OVRA_bit        _BIT_ACCESS(CWG1STR,4)
// CWG1STR<CWG1OVRB>
extern volatile __bit                   CWG1OVRB            __at(0x79F5);	// @ (0xF3E * 8 + 5)
#define                                 CWG1OVRB_bit        _BIT_ACCESS(CWG1STR,5)
// CWG1STR<CWG1OVRC>
extern volatile __bit                   CWG1OVRC            __at(0x79F6);	// @ (0xF3E * 8 + 6)
#define                                 CWG1OVRC_bit        _BIT_ACCESS(CWG1STR,6)
// CWG1STR<CWG1OVRD>
extern volatile __bit                   CWG1OVRD            __at(0x79F7);	// @ (0xF3E * 8 + 7)
#define                                 CWG1OVRD_bit        _BIT_ACCESS(CWG1STR,7)
// CWG1CON1<CWG1POLA>
extern volatile __bit                   CWG1POLA            __at(0x79D8);	// @ (0xF3B * 8 + 0)
#define                                 CWG1POLA_bit        _BIT_ACCESS(CWG1CON1,0)
// CWG1CON1<CWG1POLB>
extern volatile __bit                   CWG1POLB            __at(0x79D9);	// @ (0xF3B * 8 + 1)
#define                                 CWG1POLB_bit        _BIT_ACCESS(CWG1CON1,1)
// CWG1CON1<CWG1POLC>
extern volatile __bit                   CWG1POLC            __at(0x79DA);	// @ (0xF3B * 8 + 2)
#define                                 CWG1POLC_bit        _BIT_ACCESS(CWG1CON1,2)
// CWG1CON1<CWG1POLD>
extern volatile __bit                   CWG1POLD            __at(0x79DB);	// @ (0xF3B * 8 + 3)
#define                                 CWG1POLD_bit        _BIT_ACCESS(CWG1CON1,3)
// CWG1AS0<CWG1REN>
extern volatile __bit                   CWG1REN             __at(0x79E6);	// @ (0xF3C * 8 + 6)
#define                                 CWG1REN_bit         _BIT_ACCESS(CWG1AS0,6)
// CWG1AS0<CWG1SHUTDOWN>
extern volatile __bit                   CWG1SHUTDOWN        __at(0x79E7);	// @ (0xF3C * 8 + 7)
#define                                 CWG1SHUTDOWN_bit    _BIT_ACCESS(CWG1AS0,7)
// CWG1STR<CWG1STRA>
extern volatile __bit                   CWG1STRA            __at(0x79F0);	// @ (0xF3E * 8 + 0)
#define                                 CWG1STRA_bit        _BIT_ACCESS(CWG1STR,0)
// CWG1STR<CWG1STRB>
extern volatile __bit                   CWG1STRB            __at(0x79F1);	// @ (0xF3E * 8 + 1)
#define                                 CWG1STRB_bit        _BIT_ACCESS(CWG1STR,1)
// CWG1STR<CWG1STRC>
extern volatile __bit                   CWG1STRC            __at(0x79F2);	// @ (0xF3E * 8 + 2)
#define                                 CWG1STRC_bit        _BIT_ACCESS(CWG1STR,2)
// CWG1STR<CWG1STRD>
extern volatile __bit                   CWG1STRD            __at(0x79F3);	// @ (0xF3E * 8 + 3)
#define                                 CWG1STRD_bit        _BIT_ACCESS(CWG1STR,3)
// PIR8<CWGIF>
extern volatile __bit                   CWGIF               __at(0x71D8);	// @ (0xE3B * 8 + 0)
#define                                 CWGIF_bit           _BIT_ACCESS(PIR8,0)
// CWG1PPS<CWGINPPS0>
extern volatile __bit                   CWGINPPS0           __at(0x7058);	// @ (0xE0B * 8 + 0)
#define                                 CWGINPPS0_bit       _BIT_ACCESS(CWG1PPS,0)
// CWG1PPS<CWGINPPS1>
extern volatile __bit                   CWGINPPS1           __at(0x7059);	// @ (0xE0B * 8 + 1)
#define                                 CWGINPPS1_bit       _BIT_ACCESS(CWG1PPS,1)
// CWG1PPS<CWGINPPS2>
extern volatile __bit                   CWGINPPS2           __at(0x705A);	// @ (0xE0B * 8 + 2)
#define                                 CWGINPPS2_bit       _BIT_ACCESS(CWG1PPS,2)
// CWG1PPS<CWGINPPS3>
extern volatile __bit                   CWGINPPS3           __at(0x705B);	// @ (0xE0B * 8 + 3)
#define                                 CWGINPPS3_bit       _BIT_ACCESS(CWG1PPS,3)
// CWG1PPS<CWGINPPS4>
extern volatile __bit                   CWGINPPS4           __at(0x705C);	// @ (0xE0B * 8 + 4)
#define                                 CWGINPPS4_bit       _BIT_ACCESS(CWG1PPS,4)
// PMD2<CWGMD>
extern volatile __bit                   CWGMD               __at(0x7275);	// @ (0xE4E * 8 + 5)
#define                                 CWGMD_bit           _BIT_ACCESS(PMD2,5)
// SSP1STAT<DA1>
extern volatile __bit                   DA1                 __at(0x7CA5);	// @ (0xF94 * 8 + 5)
#define                                 DA1_bit             _BIT_ACCESS(SSP1STAT,5)
// SSP2STAT<DA2>
extern volatile __bit                   DA2                 __at(0x76C5);	// @ (0xED8 * 8 + 5)
#define                                 DA2_bit             _BIT_ACCESS(SSP2STAT,5)
// SCANCON0<DABORT>
extern volatile __bit                   DABORT              __at(0x7A7C);	// @ (0xF4F * 8 + 4)
#define                                 DABORT_bit          _BIT_ACCESS(SCANCON0,4)
// DAC1CON0<DAC1EN>
extern volatile __bit                   DAC1EN              __at(0x7637);	// @ (0xEC6 * 8 + 7)
#define                                 DAC1EN_bit          _BIT_ACCESS(DAC1CON0,7)
// DAC1CON0<DAC1NSS>
extern volatile __bit                   DAC1NSS             __at(0x7630);	// @ (0xEC6 * 8 + 0)
#define                                 DAC1NSS_bit         _BIT_ACCESS(DAC1CON0,0)
// DAC1CON0<DAC1OE1>
extern volatile __bit                   DAC1OE1             __at(0x7635);	// @ (0xEC6 * 8 + 5)
#define                                 DAC1OE1_bit         _BIT_ACCESS(DAC1CON0,5)
// DAC1CON0<DAC1OE2>
extern volatile __bit                   DAC1OE2             __at(0x7634);	// @ (0xEC6 * 8 + 4)
#define                                 DAC1OE2_bit         _BIT_ACCESS(DAC1CON0,4)
// DAC1CON0<DAC1PSS0>
extern volatile __bit                   DAC1PSS0            __at(0x7632);	// @ (0xEC6 * 8 + 2)
#define                                 DAC1PSS0_bit        _BIT_ACCESS(DAC1CON0,2)
// DAC1CON0<DAC1PSS1>
extern volatile __bit                   DAC1PSS1            __at(0x7633);	// @ (0xEC6 * 8 + 3)
#define                                 DAC1PSS1_bit        _BIT_ACCESS(DAC1CON0,3)
// DAC1CON1<DAC1R0>
extern volatile __bit                   DAC1R0              __at(0x7638);	// @ (0xEC7 * 8 + 0)
#define                                 DAC1R0_bit          _BIT_ACCESS(DAC1CON1,0)
// DAC1CON1<DAC1R1>
extern volatile __bit                   DAC1R1              __at(0x7639);	// @ (0xEC7 * 8 + 1)
#define                                 DAC1R1_bit          _BIT_ACCESS(DAC1CON1,1)
// DAC1CON1<DAC1R2>
extern volatile __bit                   DAC1R2              __at(0x763A);	// @ (0xEC7 * 8 + 2)
#define                                 DAC1R2_bit          _BIT_ACCESS(DAC1CON1,2)
// DAC1CON1<DAC1R3>
extern volatile __bit                   DAC1R3              __at(0x763B);	// @ (0xEC7 * 8 + 3)
#define                                 DAC1R3_bit          _BIT_ACCESS(DAC1CON1,3)
// DAC1CON1<DAC1R4>
extern volatile __bit                   DAC1R4              __at(0x763C);	// @ (0xEC7 * 8 + 4)
#define                                 DAC1R4_bit          _BIT_ACCESS(DAC1CON1,4)
// PMD3<DACMD>
extern volatile __bit                   DACMD               __at(0x727E);	// @ (0xE4F * 8 + 6)
#define                                 DACMD_bit           _BIT_ACCESS(PMD3,6)
// CRCDATL<DATA0>
extern volatile __bit                   DATA0               __at(0x79F8);	// @ (0xF3F * 8 + 0)
#define                                 DATA0_bit           _BIT_ACCESS(CRCDATL,0)
// CRCDATL<DATA1>
extern volatile __bit                   DATA1               __at(0x79F9);	// @ (0xF3F * 8 + 1)
#define                                 DATA1_bit           _BIT_ACCESS(CRCDATL,1)
// CRCDATH<DATA10>
extern volatile __bit                   DATA10              __at(0x7A02);	// @ (0xF40 * 8 + 2)
#define                                 DATA10_bit          _BIT_ACCESS(CRCDATH,2)
// CRCDATH<DATA11>
extern volatile __bit                   DATA11              __at(0x7A03);	// @ (0xF40 * 8 + 3)
#define                                 DATA11_bit          _BIT_ACCESS(CRCDATH,3)
// CRCDATH<DATA12>
extern volatile __bit                   DATA12              __at(0x7A04);	// @ (0xF40 * 8 + 4)
#define                                 DATA12_bit          _BIT_ACCESS(CRCDATH,4)
// CRCDATH<DATA13>
extern volatile __bit                   DATA13              __at(0x7A05);	// @ (0xF40 * 8 + 5)
#define                                 DATA13_bit          _BIT_ACCESS(CRCDATH,5)
// CRCDATH<DATA14>
extern volatile __bit                   DATA14              __at(0x7A06);	// @ (0xF40 * 8 + 6)
#define                                 DATA14_bit          _BIT_ACCESS(CRCDATH,6)
// CRCDATH<DATA15>
extern volatile __bit                   DATA15              __at(0x7A07);	// @ (0xF40 * 8 + 7)
#define                                 DATA15_bit          _BIT_ACCESS(CRCDATH,7)
// CRCDATL<DATA2>
extern volatile __bit                   DATA2               __at(0x79FA);	// @ (0xF3F * 8 + 2)
#define                                 DATA2_bit           _BIT_ACCESS(CRCDATL,2)
// CRCDATL<DATA3>
extern volatile __bit                   DATA3               __at(0x79FB);	// @ (0xF3F * 8 + 3)
#define                                 DATA3_bit           _BIT_ACCESS(CRCDATL,3)
// CRCDATL<DATA4>
extern volatile __bit                   DATA4               __at(0x79FC);	// @ (0xF3F * 8 + 4)
#define                                 DATA4_bit           _BIT_ACCESS(CRCDATL,4)
// CRCDATL<DATA5>
extern volatile __bit                   DATA5               __at(0x79FD);	// @ (0xF3F * 8 + 5)
#define                                 DATA5_bit           _BIT_ACCESS(CRCDATL,5)
// CRCDATL<DATA6>
extern volatile __bit                   DATA6               __at(0x79FE);	// @ (0xF3F * 8 + 6)
#define                                 DATA6_bit           _BIT_ACCESS(CRCDATL,6)
// CRCDATL<DATA7>
extern volatile __bit                   DATA7               __at(0x79FF);	// @ (0xF3F * 8 + 7)
#define                                 DATA7_bit           _BIT_ACCESS(CRCDATL,7)
// CRCDATH<DATA8>
extern volatile __bit                   DATA8               __at(0x7A00);	// @ (0xF40 * 8 + 0)
#define                                 DATA8_bit           _BIT_ACCESS(CRCDATH,0)
// CRCDATH<DATA9>
extern volatile __bit                   DATA9               __at(0x7A01);	// @ (0xF40 * 8 + 1)
#define                                 DATA9_bit           _BIT_ACCESS(CRCDATH,1)
// SSP1STAT<DATA_ADDRESS1>
extern volatile __bit                   DATA_ADDRESS1       __at(0x7CA5);	// @ (0xF94 * 8 + 5)
#define                                 DATA_ADDRESS1_bit   _BIT_ACCESS(SSP1STAT,5)
// SSP2STAT<DATA_ADDRESS2>
extern volatile __bit                   DATA_ADDRESS2       __at(0x76C5);	// @ (0xED8 * 8 + 5)
#define                                 DATA_ADDRESS2_bit   _BIT_ACCESS(SSP2STAT,5)
// CWG1DBF<DBF0>
extern volatile __bit                   DBF0                __at(0x79C8);	// @ (0xF39 * 8 + 0)
#define                                 DBF0_bit            _BIT_ACCESS(CWG1DBF,0)
// CWG1DBF<DBF1>
extern volatile __bit                   DBF1                __at(0x79C9);	// @ (0xF39 * 8 + 1)
#define                                 DBF1_bit            _BIT_ACCESS(CWG1DBF,1)
// CWG1DBF<DBF2>
extern volatile __bit                   DBF2                __at(0x79CA);	// @ (0xF39 * 8 + 2)
#define                                 DBF2_bit            _BIT_ACCESS(CWG1DBF,2)
// CWG1DBF<DBF3>
extern volatile __bit                   DBF3                __at(0x79CB);	// @ (0xF39 * 8 + 3)
#define                                 DBF3_bit            _BIT_ACCESS(CWG1DBF,3)
// CWG1DBF<DBF4>
extern volatile __bit                   DBF4                __at(0x79CC);	// @ (0xF39 * 8 + 4)
#define                                 DBF4_bit            _BIT_ACCESS(CWG1DBF,4)
// CWG1DBF<DBF5>
extern volatile __bit                   DBF5                __at(0x79CD);	// @ (0xF39 * 8 + 5)
#define                                 DBF5_bit            _BIT_ACCESS(CWG1DBF,5)
// CWG1DBR<DBR0>
extern volatile __bit                   DBR0                __at(0x79C0);	// @ (0xF38 * 8 + 0)
