GopalSaraf/Practicals/PSDL/include/proc/pic18lf66k40.h
extern volatile __bit                   UART4MD             __at(0x728D);	// @ (0xE51 * 8 + 5)
#define                                 UART4MD_bit         _BIT_ACCESS(PMD5,5)
// PMD5<UART5MD>
extern volatile __bit                   UART5MD             __at(0x728E);	// @ (0xE51 * 8 + 6)
#define                                 UART5MD_bit         _BIT_ACCESS(PMD5,6)
// PORTA<ULPWUIN>
extern volatile __bit                   ULPWUIN             __at(0x7C48);	// @ (0xF89 * 8 + 0)
#define                                 ULPWUIN_bit         _BIT_ACCESS(PORTA,0)
// BAUD1CON<W4E>
extern volatile __bit                   W4E                 __at(0x7CF1);	// @ (0xF9E * 8 + 1)
#define                                 W4E_bit             _BIT_ACCESS(BAUD1CON,1)
// SSP1CON1<WCOL1>
extern volatile __bit                   WCOL1               __at(0x7CAF);	// @ (0xF95 * 8 + 7)
#define                                 WCOL1_bit           _BIT_ACCESS(SSP1CON1,7)
// SSP2CON1<WCOL2>
extern volatile __bit                   WCOL2               __at(0x76CF);	// @ (0xED9 * 8 + 7)
#define                                 WCOL2_bit           _BIT_ACCESS(SSP2CON1,7)
// WDTCON1<WDTCS0>
extern volatile __bit                   WDTCS0              __at(0x71F4);	// @ (0xE3E * 8 + 4)
#define                                 WDTCS0_bit          _BIT_ACCESS(WDTCON1,4)
// WDTCON1<WDTCS1>
extern volatile __bit                   WDTCS1              __at(0x71F5);	// @ (0xE3E * 8 + 5)
#define                                 WDTCS1_bit          _BIT_ACCESS(WDTCON1,5)
// WDTCON1<WDTCS2>
extern volatile __bit                   WDTCS2              __at(0x71F6);	// @ (0xE3E * 8 + 6)
#define                                 WDTCS2_bit          _BIT_ACCESS(WDTCON1,6)
// WDTCON0<WDTPS0>
extern volatile __bit                   WDTPS0              __at(0x71E9);	// @ (0xE3D * 8 + 1)
#define                                 WDTPS0_bit          _BIT_ACCESS(WDTCON0,1)
// WDTCON0<WDTPS1>
extern volatile __bit                   WDTPS1              __at(0x71EA);	// @ (0xE3D * 8 + 2)
#define                                 WDTPS1_bit          _BIT_ACCESS(WDTCON0,2)
// WDTCON0<WDTPS2>
extern volatile __bit                   WDTPS2              __at(0x71EB);	// @ (0xE3D * 8 + 3)
#define                                 WDTPS2_bit          _BIT_ACCESS(WDTCON0,3)
// WDTCON0<WDTPS3>
extern volatile __bit                   WDTPS3              __at(0x71EC);	// @ (0xE3D * 8 + 4)
#define                                 WDTPS3_bit          _BIT_ACCESS(WDTCON0,4)
// WDTCON0<WDTPS4>
extern volatile __bit                   WDTPS4              __at(0x71ED);	// @ (0xE3D * 8 + 5)
#define                                 WDTPS4_bit          _BIT_ACCESS(WDTCON0,5)
// WDTPSL<WDTPSCNT0>
extern volatile __bit                   WDTPSCNT0           __at(0x71F8);	// @ (0xE3F * 8 + 0)
#define                                 WDTPSCNT0_bit       _BIT_ACCESS(WDTPSL,0)
// WDTPSL<WDTPSCNT1>
extern volatile __bit                   WDTPSCNT1           __at(0x71F9);	// @ (0xE3F * 8 + 1)
#define                                 WDTPSCNT1_bit       _BIT_ACCESS(WDTPSL,1)
// WDTPSH<WDTPSCNT10>
extern volatile __bit                   WDTPSCNT10          __at(0x7202);	// @ (0xE40 * 8 + 2)
#define                                 WDTPSCNT10_bit      _BIT_ACCESS(WDTPSH,2)
// WDTPSH<WDTPSCNT11>
extern volatile __bit                   WDTPSCNT11          __at(0x7203);	// @ (0xE40 * 8 + 3)
#define                                 WDTPSCNT11_bit      _BIT_ACCESS(WDTPSH,3)
// WDTPSH<WDTPSCNT12>
extern volatile __bit                   WDTPSCNT12          __at(0x7204);	// @ (0xE40 * 8 + 4)
#define                                 WDTPSCNT12_bit      _BIT_ACCESS(WDTPSH,4)
// WDTPSH<WDTPSCNT13>
extern volatile __bit                   WDTPSCNT13          __at(0x7205);	// @ (0xE40 * 8 + 5)
#define                                 WDTPSCNT13_bit      _BIT_ACCESS(WDTPSH,5)
// WDTPSH<WDTPSCNT14>
extern volatile __bit                   WDTPSCNT14          __at(0x7206);	// @ (0xE40 * 8 + 6)
#define                                 WDTPSCNT14_bit      _BIT_ACCESS(WDTPSH,6)
// WDTPSH<WDTPSCNT15>
extern volatile __bit                   WDTPSCNT15          __at(0x7207);	// @ (0xE40 * 8 + 7)
#define                                 WDTPSCNT15_bit      _BIT_ACCESS(WDTPSH,7)
// WDTTMR<WDTPSCNT16>
extern volatile __bit                   WDTPSCNT16          __at(0x7208);	// @ (0xE41 * 8 + 0)
#define                                 WDTPSCNT16_bit      _BIT_ACCESS(WDTTMR,0)
// WDTTMR<WDTPSCNT17>
extern volatile __bit                   WDTPSCNT17          __at(0x7209);	// @ (0xE41 * 8 + 1)
#define                                 WDTPSCNT17_bit      _BIT_ACCESS(WDTTMR,1)
// WDTPSL<WDTPSCNT2>
extern volatile __bit                   WDTPSCNT2           __at(0x71FA);	// @ (0xE3F * 8 + 2)
#define                                 WDTPSCNT2_bit       _BIT_ACCESS(WDTPSL,2)
// WDTPSL<WDTPSCNT3>
extern volatile __bit                   WDTPSCNT3           __at(0x71FB);	// @ (0xE3F * 8 + 3)
#define                                 WDTPSCNT3_bit       _BIT_ACCESS(WDTPSL,3)
// WDTPSL<WDTPSCNT4>
extern volatile __bit                   WDTPSCNT4           __at(0x71FC);	// @ (0xE3F * 8 + 4)
#define                                 WDTPSCNT4_bit       _BIT_ACCESS(WDTPSL,4)
// WDTPSL<WDTPSCNT5>
extern volatile __bit                   WDTPSCNT5           __at(0x71FD);	// @ (0xE3F * 8 + 5)
#define                                 WDTPSCNT5_bit       _BIT_ACCESS(WDTPSL,5)
// WDTPSL<WDTPSCNT6>
extern volatile __bit                   WDTPSCNT6           __at(0x71FE);	// @ (0xE3F * 8 + 6)
#define                                 WDTPSCNT6_bit       _BIT_ACCESS(WDTPSL,6)
// WDTPSL<WDTPSCNT7>
extern volatile __bit                   WDTPSCNT7           __at(0x71FF);	// @ (0xE3F * 8 + 7)
#define                                 WDTPSCNT7_bit       _BIT_ACCESS(WDTPSL,7)
// WDTPSH<WDTPSCNT8>
extern volatile __bit                   WDTPSCNT8           __at(0x7200);	// @ (0xE40 * 8 + 0)
#define                                 WDTPSCNT8_bit       _BIT_ACCESS(WDTPSH,0)
// WDTPSH<WDTPSCNT9>
extern volatile __bit                   WDTPSCNT9           __at(0x7201);	// @ (0xE40 * 8 + 1)
#define                                 WDTPSCNT9_bit       _BIT_ACCESS(WDTPSH,1)
// WDTCON0<WDTSEN>
extern volatile __bit                   WDTSEN              __at(0x71E8);	// @ (0xE3D * 8 + 0)
#define                                 WDTSEN_bit          _BIT_ACCESS(WDTCON0,0)
// WDTTMR<WDTSTATE>
extern volatile __bit                   WDTSTATE            __at(0x720A);	// @ (0xE41 * 8 + 2)
#define                                 WDTSTATE_bit        _BIT_ACCESS(WDTTMR,2)
// WDTTMR<WDTTMR0>
extern volatile __bit                   WDTTMR0             __at(0x720B);	// @ (0xE41 * 8 + 3)
#define                                 WDTTMR0_bit         _BIT_ACCESS(WDTTMR,3)
// WDTTMR<WDTTMR1>
extern volatile __bit                   WDTTMR1             __at(0x720C);	// @ (0xE41 * 8 + 4)
#define                                 WDTTMR1_bit         _BIT_ACCESS(WDTTMR,4)
// WDTTMR<WDTTMR2>
extern volatile __bit                   WDTTMR2             __at(0x720D);	// @ (0xE41 * 8 + 5)
#define                                 WDTTMR2_bit         _BIT_ACCESS(WDTTMR,5)
// WDTTMR<WDTTMR3>
extern volatile __bit                   WDTTMR3             __at(0x720E);	// @ (0xE41 * 8 + 6)
#define                                 WDTTMR3_bit         _BIT_ACCESS(WDTTMR,6)
// WDTTMR<WDTTMR4>
extern volatile __bit                   WDTTMR4             __at(0x720F);	// @ (0xE41 * 8 + 7)
#define                                 WDTTMR4_bit         _BIT_ACCESS(WDTTMR,7)
// WDTCON1<WDTWINDOW0>
extern volatile __bit                   WDTWINDOW0          __at(0x71F0);	// @ (0xE3E * 8 + 0)
#define                                 WDTWINDOW0_bit      _BIT_ACCESS(WDTCON1,0)
// WDTCON1<WDTWINDOW1>
extern volatile __bit                   WDTWINDOW1          __at(0x71F1);	// @ (0xE3E * 8 + 1)
#define                                 WDTWINDOW1_bit      _BIT_ACCESS(WDTCON1,1)
// WDTCON1<WDTWINDOW2>
extern volatile __bit                   WDTWINDOW2          __at(0x71F2);	// @ (0xE3E * 8 + 2)
#define                                 WDTWINDOW2_bit      _BIT_ACCESS(WDTCON1,2)
// PCON0<WDTWV>
extern volatile __bit                   WDTWV               __at(0x7EBD);	// @ (0xFD7 * 8 + 5)
#define                                 WDTWV_bit           _BIT_ACCESS(PCON0,5)
// WDTCON1<WINDOW0>
extern volatile __bit                   WINDOW0             __at(0x71F0);	// @ (0xE3E * 8 + 0)
#define                                 WINDOW0_bit         _BIT_ACCESS(WDTCON1,0)
// WDTCON1<WINDOW1>
extern volatile __bit                   WINDOW1             __at(0x71F1);	// @ (0xE3E * 8 + 1)
#define                                 WINDOW1_bit         _BIT_ACCESS(WDTCON1,1)
// WDTCON1<WINDOW2>
extern volatile __bit                   WINDOW2             __at(0x71F2);	// @ (0xE3E * 8 + 2)
#define                                 WINDOW2_bit         _BIT_ACCESS(WDTCON1,2)
// WPUA<WPUA0>
extern volatile __bit                   WPUA0               __at(0x7488);	// @ (0xE91 * 8 + 0)
#define                                 WPUA0_bit           _BIT_ACCESS(WPUA,0)
// WPUA<WPUA1>
extern volatile __bit                   WPUA1               __at(0x7489);	// @ (0xE91 * 8 + 1)
#define                                 WPUA1_bit           _BIT_ACCESS(WPUA,1)
// WPUA<WPUA2>
extern volatile __bit                   WPUA2               __at(0x748A);	// @ (0xE91 * 8 + 2)
#define                                 WPUA2_bit           _BIT_ACCESS(WPUA,2)
// WPUA<WPUA3>
extern volatile __bit                   WPUA3               __at(0x748B);	// @ (0xE91 * 8 + 3)
#define                                 WPUA3_bit           _BIT_ACCESS(WPUA,3)
// WPUA<WPUA4>
extern volatile __bit                   WPUA4               __at(0x748C);	// @ (0xE91 * 8 + 4)
#define                                 WPUA4_bit           _BIT_ACCESS(WPUA,4)
// WPUA<WPUA5>
extern volatile __bit                   WPUA5               __at(0x748D);	// @ (0xE91 * 8 + 5)
#define                                 WPUA5_bit           _BIT_ACCESS(WPUA,5)
// WPUA<WPUA6>
extern volatile __bit                   WPUA6               __at(0x748E);	// @ (0xE91 * 8 + 6)
#define                                 WPUA6_bit           _BIT_ACCESS(WPUA,6)
// WPUA<WPUA7>
extern volatile __bit                   WPUA7               __at(0x748F);	// @ (0xE91 * 8 + 7)
#define                                 WPUA7_bit           _BIT_ACCESS(WPUA,7)
// WPUB<WPUB0>
extern volatile __bit                   WPUB0               __at(0x74C8);	// @ (0xE99 * 8 + 0)
#define                                 WPUB0_bit           _BIT_ACCESS(WPUB,0)
// WPUB<WPUB1>
extern volatile __bit                   WPUB1               __at(0x74C9);	// @ (0xE99 * 8 + 1)
#define                                 WPUB1_bit           _BIT_ACCESS(WPUB,1)
// WPUB<WPUB2>
extern volatile __bit                   WPUB2               __at(0x74CA);	// @ (0xE99 * 8 + 2)
#define                                 WPUB2_bit           _BIT_ACCESS(WPUB,2)
// WPUB<WPUB3>
extern volatile __bit                   WPUB3               __at(0x74CB);	// @ (0xE99 * 8 + 3)
#define                                 WPUB3_bit           _BIT_ACCESS(WPUB,3)
// WPUB<WPUB4>
extern volatile __bit                   WPUB4               __at(0x74CC);	// @ (0xE99 * 8 + 4)
#define                                 WPUB4_bit           _BIT_ACCESS(WPUB,4)
// WPUB<WPUB5>
extern volatile __bit                   WPUB5               __at(0x74CD);	// @ (0xE99 * 8 + 5)
#define                                 WPUB5_bit           _BIT_ACCESS(WPUB,5)
// WPUB<WPUB6>
extern volatile __bit                   WPUB6               __at(0x74CE);	// @ (0xE99 * 8 + 6)
#define                                 WPUB6_bit           _BIT_ACCESS(WPUB,6)
// WPUB<WPUB7>
extern volatile __bit                   WPUB7               __at(0x74CF);	// @ (0xE99 * 8 + 7)
#define                                 WPUB7_bit           _BIT_ACCESS(WPUB,7)
// WPUC<WPUC0>
extern volatile __bit                   WPUC0               __at(0x7508);	// @ (0xEA1 * 8 + 0)
#define                                 WPUC0_bit           _BIT_ACCESS(WPUC,0)
// WPUC<WPUC1>
extern volatile __bit                   WPUC1               __at(0x7509);	// @ (0xEA1 * 8 + 1)
#define                                 WPUC1_bit           _BIT_ACCESS(WPUC,1)
// WPUC<WPUC2>
extern volatile __bit                   WPUC2               __at(0x750A);	// @ (0xEA1 * 8 + 2)
#define                                 WPUC2_bit           _BIT_ACCESS(WPUC,2)
// WPUC<WPUC3>
extern volatile __bit                   WPUC3               __at(0x750B);	// @ (0xEA1 * 8 + 3)
#define                                 WPUC3_bit           _BIT_ACCESS(WPUC,3)
// WPUC<WPUC4>
extern volatile __bit                   WPUC4               __at(0x750C);	// @ (0xEA1 * 8 + 4)
#define                                 WPUC4_bit           _BIT_ACCESS(WPUC,4)
// WPUC<WPUC5>
extern volatile __bit                   WPUC5               __at(0x750D);	// @ (0xEA1 * 8 + 5)
#define                                 WPUC5_bit           _BIT_ACCESS(WPUC,5)
// WPUC<WPUC6>
extern volatile __bit                   WPUC6               __at(0x750E);	// @ (0xEA1 * 8 + 6)
#define                                 WPUC6_bit           _BIT_ACCESS(WPUC,6)
// WPUC<WPUC7>
extern volatile __bit                   WPUC7               __at(0x750F);	// @ (0xEA1 * 8 + 7)
#define                                 WPUC7_bit           _BIT_ACCESS(WPUC,7)
// WPUD<WPUD0>
extern volatile __bit                   WPUD0               __at(0x7530);	// @ (0xEA6 * 8 + 0)
#define                                 WPUD0_bit           _BIT_ACCESS(WPUD,0)
// WPUD<WPUD1>
extern volatile __bit                   WPUD1               __at(0x7531);	// @ (0xEA6 * 8 + 1)
#define                                 WPUD1_bit           _BIT_ACCESS(WPUD,1)
// WPUD<WPUD2>
extern volatile __bit                   WPUD2               __at(0x7532);	// @ (0xEA6 * 8 + 2)
#define                                 WPUD2_bit           _BIT_ACCESS(WPUD,2)
// WPUD<WPUD3>
extern volatile __bit                   WPUD3               __at(0x7533);	// @ (0xEA6 * 8 + 3)
#define                                 WPUD3_bit           _BIT_ACCESS(WPUD,3)
// WPUD<WPUD4>
extern volatile __bit                   WPUD4               __at(0x7534);	// @ (0xEA6 * 8 + 4)
#define                                 WPUD4_bit           _BIT_ACCESS(WPUD,4)
// WPUD<WPUD5>
extern volatile __bit                   WPUD5               __at(0x7535);	// @ (0xEA6 * 8 + 5)
#define                                 WPUD5_bit           _BIT_ACCESS(WPUD,5)
// WPUD<WPUD6>
extern volatile __bit                   WPUD6               __at(0x7536);	// @ (0xEA6 * 8 + 6)
#define                                 WPUD6_bit           _BIT_ACCESS(WPUD,6)
// WPUD<WPUD7>
extern volatile __bit                   WPUD7               __at(0x7537);	// @ (0xEA6 * 8 + 7)
#define                                 WPUD7_bit           _BIT_ACCESS(WPUD,7)
// WPUE<WPUE0>
extern volatile __bit                   WPUE0               __at(0x7570);	// @ (0xEAE * 8 + 0)
#define                                 WPUE0_bit           _BIT_ACCESS(WPUE,0)
// WPUE<WPUE1>
extern volatile __bit                   WPUE1               __at(0x7571);	// @ (0xEAE * 8 + 1)
#define                                 WPUE1_bit           _BIT_ACCESS(WPUE,1)
// WPUE<WPUE2>
extern volatile __bit                   WPUE2               __at(0x7572);	// @ (0xEAE * 8 + 2)
#define                                 WPUE2_bit           _BIT_ACCESS(WPUE,2)
// WPUE<WPUE3>
extern volatile __bit                   WPUE3               __at(0x7573);	// @ (0xEAE * 8 + 3)
#define                                 WPUE3_bit           _BIT_ACCESS(WPUE,3)
// WPUE<WPUE4>
extern volatile __bit                   WPUE4               __at(0x7574);	// @ (0xEAE * 8 + 4)
#define                                 WPUE4_bit           _BIT_ACCESS(WPUE,4)
// WPUE<WPUE5>
extern volatile __bit                   WPUE5               __at(0x7575);	// @ (0xEAE * 8 + 5)
#define                                 WPUE5_bit           _BIT_ACCESS(WPUE,5)
// WPUE<WPUE6>
extern volatile __bit                   WPUE6               __at(0x7576);	// @ (0xEAE * 8 + 6)
#define                                 WPUE6_bit           _BIT_ACCESS(WPUE,6)
// WPUE<WPUE7>
extern volatile __bit                   WPUE7               __at(0x7577);	// @ (0xEAE * 8 + 7)
#define                                 WPUE7_bit           _BIT_ACCESS(WPUE,7)
// WPUF<WPUF0>
extern volatile __bit                   WPUF0               __at(0x7598);	// @ (0xEB3 * 8 + 0)
#define                                 WPUF0_bit           _BIT_ACCESS(WPUF,0)
// WPUF<WPUF1>
extern volatile __bit                   WPUF1               __at(0x7599);	// @ (0xEB3 * 8 + 1)
#define                                 WPUF1_bit           _BIT_ACCESS(WPUF,1)
// WPUF<WPUF2>
extern volatile __bit                   WPUF2               __at(0x759A);	// @ (0xEB3 * 8 + 2)
#define                                 WPUF2_bit           _BIT_ACCESS(WPUF,2)
// WPUF<WPUF3>
extern volatile __bit                   WPUF3               __at(0x759B);	// @ (0xEB3 * 8 + 3)
#define                                 WPUF3_bit           _BIT_ACCESS(WPUF,3)
// WPUF<WPUF4>
extern volatile __bit                   WPUF4               __at(0x759C);	// @ (0xEB3 * 8 + 4)
#define                                 WPUF4_bit           _BIT_ACCESS(WPUF,4)
// WPUF<WPUF5>
extern volatile __bit                   WPUF5               __at(0x759D);	// @ (0xEB3 * 8 + 5)
#define                                 WPUF5_bit           _BIT_ACCESS(WPUF,5)
// WPUF<WPUF6>
extern volatile __bit                   WPUF6               __at(0x759E);	// @ (0xEB3 * 8 + 6)
#define                                 WPUF6_bit           _BIT_ACCESS(WPUF,6)
// WPUF<WPUF7>
extern volatile __bit                   WPUF7               __at(0x759F);	// @ (0xEB3 * 8 + 7)
#define                                 WPUF7_bit           _BIT_ACCESS(WPUF,7)
// WPUG<WPUG0>
extern volatile __bit                   WPUG0               __at(0x75D8);	// @ (0xEBB * 8 + 0)
#define                                 WPUG0_bit           _BIT_ACCESS(WPUG,0)
// WPUG<WPUG1>
extern volatile __bit                   WPUG1               __at(0x75D9);	// @ (0xEBB * 8 + 1)
#define                                 WPUG1_bit           _BIT_ACCESS(WPUG,1)
// WPUG<WPUG2>
extern volatile __bit                   WPUG2               __at(0x75DA);	// @ (0xEBB * 8 + 2)
#define                                 WPUG2_bit           _BIT_ACCESS(WPUG,2)
// WPUG<WPUG3>
extern volatile __bit                   WPUG3               __at(0x75DB);	// @ (0xEBB * 8 + 3)
#define                                 WPUG3_bit           _BIT_ACCESS(WPUG,3)
// WPUG<WPUG4>
extern volatile __bit                   WPUG4               __at(0x75DC);	// @ (0xEBB * 8 + 4)
#define                                 WPUG4_bit           _BIT_ACCESS(WPUG,4)
// WPUG<WPUG5>
extern volatile __bit                   WPUG5               __at(0x75DD);	// @ (0xEBB * 8 + 5)
#define                                 WPUG5_bit           _BIT_ACCESS(WPUG,5)
// WPUG<WPUG6>
extern volatile __bit                   WPUG6               __at(0x75DE);	// @ (0xEBB * 8 + 6)
#define                                 WPUG6_bit           _BIT_ACCESS(WPUG,6)
// WPUG<WPUG7>
extern volatile __bit                   WPUG7               __at(0x75DF);	// @ (0xEBB * 8 + 7)
#define                                 WPUG7_bit           _BIT_ACCESS(WPUG,7)
// WPUH<WPUH0>
extern volatile __bit                   WPUH0               __at(0x7600);	// @ (0xEC0 * 8 + 0)
#define                                 WPUH0_bit           _BIT_ACCESS(WPUH,0)
// WPUH<WPUH1>
extern volatile __bit                   WPUH1               __at(0x7601);	// @ (0xEC0 * 8 + 1)
#define                                 WPUH1_bit           _BIT_ACCESS(WPUH,1)
// WPUH<WPUH2>
extern volatile __bit                   WPUH2               __at(0x7602);	// @ (0xEC0 * 8 + 2)
#define                                 WPUH2_bit           _BIT_ACCESS(WPUH,2)
// WPUH<WPUH3>
extern volatile __bit                   WPUH3               __at(0x7603);	// @ (0xEC0 * 8 + 3)
#define                                 WPUH3_bit           _BIT_ACCESS(WPUH,3)
// NVMCON1<WR>
extern volatile __bit                   WR                  __at(0x7BB9);	// @ (0xF77 * 8 + 1)
#define                                 WR_bit              _BIT_ACCESS(NVMCON1,1)
// PORTE<WRE>
extern volatile __bit                   WRE                 __at(0x7C69);	// @ (0xF8D * 8 + 1)
#define                                 WRE_bit             _BIT_ACCESS(PORTE,1)
// NVMCON1<WREN>
extern volatile __bit                   WREN                __at(0x7BBA);	// @ (0xF77 * 8 + 2)
#define                                 WREN_bit            _BIT_ACCESS(NVMCON1,2)
// NVMCON1<WRERR>
extern volatile __bit                   WRERR               __at(0x7BBB);	// @ (0xF77 * 8 + 3)
#define                                 WRERR_bit           _BIT_ACCESS(NVMCON1,3)
// BAUD1CON<WUE1>
extern volatile __bit                   WUE1                __at(0x7CF1);	// @ (0xF9E * 8 + 1)
#define                                 WUE1_bit            _BIT_ACCESS(BAUD1CON,1)
// BAUD2CON<WUE2>
extern volatile __bit                   WUE2                __at(0x77B9);	// @ (0xEF7 * 8 + 1)
#define                                 WUE2_bit            _BIT_ACCESS(BAUD2CON,1)
// CRCXORL<X1>
extern volatile __bit                   X1                  __at(0x7A29);	// @ (0xF45 * 8 + 1)
#define                                 X1_bit              _BIT_ACCESS(CRCXORL,1)
// CRCXORH<X10>
extern volatile __bit                   X10                 __at(0x7A32);	// @ (0xF46 * 8 + 2)
#define                                 X10_bit             _BIT_ACCESS(CRCXORH,2)
// CRCXORH<X11>
extern volatile __bit                   X11                 __at(0x7A33);	// @ (0xF46 * 8 + 3)
#define                                 X11_bit             _BIT_ACCESS(CRCXORH,3)
// CRCXORH<X12>
extern volatile __bit                   X12                 __at(0x7A34);	// @ (0xF46 * 8 + 4)
#define                                 X12_bit             _BIT_ACCESS(CRCXORH,4)
// CRCXORH<X13>
extern volatile __bit                   X13                 __at(0x7A35);	// @ (0xF46 * 8 + 5)
#define                                 X13_bit             _BIT_ACCESS(CRCXORH,5)
// CRCXORH<X14>
extern volatile __bit                   X14                 __at(0x7A36);	// @ (0xF46 * 8 + 6)
#define                                 X14_bit             _BIT_ACCESS(CRCXORH,6)
// CRCXORH<X15>
extern volatile __bit                   X15                 __at(0x7A37);	// @ (0xF46 * 8 + 7)
#define                                 X15_bit             _BIT_ACCESS(CRCXORH,7)
// CRCXORL<X2>
extern volatile __bit                   X2                  __at(0x7A2A);	// @ (0xF45 * 8 + 2)
#define                                 X2_bit              _BIT_ACCESS(CRCXORL,2)
// CRCXORL<X3>
extern volatile __bit                   X3                  __at(0x7A2B);	// @ (0xF45 * 8 + 3)
#define                                 X3_bit              _BIT_ACCESS(CRCXORL,3)
// CRCXORL<X4>
extern volatile __bit                   X4                  __at(0x7A2C);	// @ (0xF45 * 8 + 4)
#define                                 X4_bit              _BIT_ACCESS(CRCXORL,4)
// CRCXORL<X5>
extern volatile __bit                   X5                  __at(0x7A2D);	// @ (0xF45 * 8 + 5)
#define                                 X5_bit              _BIT_ACCESS(CRCXORL,5)
// CRCXORL<X6>
extern volatile __bit                   X6                  __at(0x7A2E);	// @ (0xF45 * 8 + 6)
#define                                 X6_bit              _BIT_ACCESS(CRCXORL,6)
// CRCXORL<X7>
